"use client";

import styles from "./page.module.css";
import Lazarus from "./images/lazarus.jpg";
import Image from "next/image";
import { useState } from "react";

export default function ThomasPage() {
  const [expanded, setExpanded] = useState(false);

  return (
    <div className={styles.container}>
      <h1 className={styles.mainHeader}>Дивись, як Він любив його</h1>
      <article className={styles.article}>
        <figure className={styles.mediaFloat}>
          <div className={styles.imageWrapper}>
            <Image
              src={Lazarus}
              alt="Ікона Воскресіння Лазаря"
              fill
              sizes="(max-width: 768px) 100vw, 40vw"
            />
          </div>
          <figcaption className={styles.caption}>
            &quot;Воскресіння Лазаря&quot; Федуско (ікона 16 ст.)
          </figcaption>
        </figure>
        <div className={!expanded ? styles.preview : ""}>
          <h3 className={styles.historyHeader}>Історія</h3>
          <p className={styles.paragraph}>
            Праведний Лазар, якого Церква називає Чотириденним, був одним із
            найближчих друзів Господа нашого Ісуса Христа. Він жив у селищі
            Віфанія, неподалік від Єрусалима, разом зі своїми сестрами — Марфою
            і Марією. Їхній дім згадується в Євангелії як місце, де Спаситель
            неодноразово перебував, навчаючи і розділяючи трапезу з тими, хто
            Його любив.
          </p>
          <p className={styles.paragraph}>
            Про ранні роки життя Лазаря Святе Письмо не подає багато відомостей,
            однак церковна традиція зберегла пам’ять про нього як про людину
            благочестиву, мирну і щиро віддану Богові. Разом зі своїми сестрами
            він належав до числа тих, хто з відкритим серцем прийняв Христа.
          </p>
          <p className={styles.paragraph}>
            Найвідомішою подією в житті Лазаря стало його воскресіння Господом
            Ісусом Христом. Коли Лазар тяжко захворів, його сестри послали
            звістку до Спасителя, сподіваючись на Його прихід. Проте коли
            Христос прибув до Віфанії, Лазар уже чотири дні перебував у гробі.
            Перед численними свідками Господь підійшов до печери і вигукнув:
            «Лазарю, вийди сюди!» — і померлий вийшов живим.
          </p>
          <p className={styles.paragraph}>
            Це чудо стало одним із найвеличніших знамень земного служіння Христа
            і водночас зробило Лазаря особливо відомим серед юдейського народу.
            Саме після цього багато людей увірували в Ісуса як у Месію. Водночас
            первосвященики, боячись зростання віри в народі, шукали не лише
            способу вбити Христа, але, за свідченням Євангелія, мали намір убити
            й Лазаря, бо через нього багато хто приходив до віри.
          </p>
          <p className={styles.paragraph}>
            За церковним переданням, після Воскресіння Христового і гонінь, що
            розпочалися в Єрусалимі, Лазар змушений був залишити Юдею. Разом із
            деякими учнями Христовими він прибув на острів Кіпр, де продовжив
            своє життя вже як учень і свідок Воскреслого Господа.
          </p>
          <p className={styles.paragraph}>
            Там, у місті Кітіоні (сучасна Ларнака), святі апостоли Павло і
            Варнава поставили його єпископом. Таким чином, праведний Лазар став
            одним із перших єпископів у Церкві Христовій. 
          </p>
          <p className={styles.paragraph}>
            За переданням, після свого воскресіння Лазар прожив ще близько
            тридцяти років. Церква вшановує його не лише як того, кого Христос
            воскресив, а й як вірного учня, єпископа і праведника.
          </p>
          <p className={styles.paragraph}>
            Праведний Лазар упокоївся на Кіпрі, де й був похований.
          </p>

          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}></p>
        </div>
        <button
          className={styles.readMore}
          onClick={() => setExpanded(!expanded)}
        >
          {expanded ? "Згорнути..." : "Читати далі..."}
        </button>
      </article>
      <article className={styles.article}>
        {" "}
        <blockquote className={styles.gospel}>
          <h3 className={styles.gospelTitle}>Євангеліє від Іоана 11:1-45</h3>Був
          один недужий — Лазар з Вифанії, села Марії та її сестри Марфи. 2 Марія
          ж, брат якої Лазар був недужий, була та, що помазала Господа миром і
          обтерла ноги Його волоссям своїм. 3 Сестри послали сказати Йому:
          Господи, ось, кого Ти любиш, нездужає. 4 Ісус, почувши те, сказав: ця
          недуга не на смерть, а на славу Божу, щоб через неї прославився Син
          Божий. 5 Ісус же любив Марфу і сестру її та Лазаря. 6 Коли ж почув, що
          він хворий, то пробув два дні на тому місці, де знаходився. 7 Після
          цього сказав ученикам: підемо знову до Юдеї. 8 Ученики сказали Йому:
          Учителю, чи давно юдеї намагалися побити Тебе камінням, і Ти знову
          йдеш туди? 9 Ісус відповів: чи не дванадцять годин є у дні? Хто ходить
          удень, той не спотикається, тому що бачить світло світу цього; 10 а
          хто ходить уночі, спотикається, бо немає світла з ним. 11 Сказавши це,
          говорить їм потім: Лазар, друг наш, заснув; але Я йду розбудити його.
          12 Ученики Його сказали: Господи, якщо заснув, то одужає. 13 Ісус
          говорив про смерть його, а вони думали, що Він говорить про звичайний
          сон. 14 Тоді Ісус сказав їм просто: Лазар помер; 15 і радію за вас, що
          Я не був там, щоб ви увірували; але ходімо до нього. 16 Тоді Фома,
          званий ще Близнюком, сказав ученикам: ходімо й ми і помремо з Ним. 17
          Прийшовши, Ісус знайшов, що він уже чотири дні у гробі. 18 Вифанія ж
          була поблизу Єрусалима, стадій з п’ятнадцять. 19 І багато юдеїв
          прийшли до Марфи й Марії, щоб утішити їх у скорботі за братом їхнім.
          20 Марфа, почувши, що йде Ісус, вийшла назустріч Йому; Марія ж сиділа
          вдома. 21 Тоді Марфа сказала Ісусові: Господи! Якби Ти був тут, не
          помер би брат мій. 22 Але й тепер знаю, що, коли чого Ти попросиш у
          Бога, дасть Тобі Бог. 23 Ісус говорить їй: воскресне брат твій. 24
          Марфа сказала Йому: знаю, що воскресне при воскресінні, в останній
          день. 25 Ісус сказав їй: Я є воскресіння і життя; хто вірує в Мене,
          якщо і помре, оживе. 26 І кожен, хто живе і вірує в Мене, не помре
          повік. Чи віриш цьому? 27 Вона говорить Йому: так, Господи! Я вірую,
          що Ти Христос, Син Божий, Який гряде у світ. 28 Сказавши так, пішла і
          покликала Марію, сестру свою, нишком, кажучи: Учитель тут і кличе
          тебе. 29 Вона, як тільки почула, поспішно встала і пішла до Нього. 30
          Ісус ще не входив у село, але був на тому місці, де зустріла Його
          Марфа. 31 Юдеї, які були з нею в домі і втішали її, коли побачили, що
          Марія поспішно встала і вийшла, пішли за нею, гадаючи, що вона пішла
          до гробу — плакати там. 32 Марія ж, прийшовши туди, де був Ісус, та
          побачивши Його, впала до ніг Його і сказала Йому: Господи! Якби Ти був
          тут, не помер би брат мій. 33 Ісус, коли побачив, що вона плаче і
          плачуть юдеї, які прийшли з нею, Сам уболівав духом і зворушився. 34 І
          сказав: де ви поклали його? Кажуть Йому: Господи, піди і подивись. 35
          Заплакав Ісус. 36 Тоді юдеї говорили: <span className={styles.quoteToHeader}> дивись, як Він любив його</span>. 37 А
          деякі з них сказали: чи не міг би Цей, що відкрив очі сліпому, зробити
          так, щоб і цей не помер? 38 Ісус же, знову пройнявшись жалем,
          приходить до гробу. То була печера, і камінь лежав на ній. 39 Ісус
          говорить: візьміть камінь. Сестра померлого, Марфа, говорить Йому:
          Господи! Вже смердить, бо чотири дні, як він у гробі. 40 Ісус говорить
          їй: чи не сказав Я тобі, що, коли будеш вірувати, побачиш славу Божу?
          41 Відвалили камінь від печери, де лежав померлий. Ісус звів очі до
          неба і сказав: Отче! Хвалу Тобі воздаю, що Ти почув Мене. 42 Я і знав,
          що Ти завжди почуєш Мене; але сказав це для народу, який стоїть тут,
          щоб повірили, що Ти послав Мене. 43 Сказавши це, Він голосно промовив:
          Лазарю! Вийди геть. 44 І вийшов померлий, оповитий по руках і ногах
          поховальними пеленами, і обличчя його обв’язане було хусткою. Ісус
          говорить їм: розв’яжіть його, нехай іде. 45 Тоді багато з юдеїв, які
          прийшли до Марії і бачили, що сотворив Ісус, увірували в Нього. 
        </blockquote>
      </article>
      <article className={styles.article}></article>
      <article className={styles.article}></article>
    </div>
  );
}
