import Image from "next/image";
import css from "./page.module.css";

import Gregory from "./images/gregory.jpg";
import ThreeSaints from "../vasyl-velykyi/images/three-saints.jpg";


export default function GregoryTheTheologianPage() {
  return (
    <article className={css.article}>
      <h1 className={css.title}>Святитель Григорій Богослов</h1>

      {/* MAIN ICON */}
      <figure className={css.mediaFloat}>
        <Image
          src={Gregory}
          alt="Святитель Григорій Богослов"
          width={560}
          height={880}
        />
        <figcaption className={css.caption}>
          Св. Григорій Богослов. Мозаїка собору Св. Софії у Києві. 1037-1045-рр
        </figcaption>
      </figure>

      <p>
        Святитель Григорій Богослов (бл. 329–390) — один із найвидатніших Отців
        Церкви, великий богослов, проповідник і поет. Церква вшановує його як
        Вселенського учителя та одного з трьох святителів, разом із Василієм
        Великим та Іоаном Золотоустим.
      </p>

      <h2>Життєпис</h2>
      <p>
        Святий Григорій народився в місті Аріанз, поблизу Назіанзу (Мала Азія),
        у благочестивій християнській родині. Його батько, Григорій Старший, був
        єпископом Назіанзьким, а мати — свята Нонна — відзначалася глибокою
        вірою та молитвою.
      </p>
      <p>
        
        Григорій здобув блискучу освіту в Кесарії, Александрії та Афінах, де
        потоваришував зі святителем Василієм Великим.
      </p>
      <p>
        Проте Церква покликала його до служіння. У важкий для православ’я час,
        коли Константинополь був охоплений аріанською єрессю, святитель Григорій
        став головним захисником істини про єдиносущність Пресвятої Трійці. Його
        знамениті “Богословські слова” стали вершиною православного вчення про
        Бога.
      </p>
      <p>
        Незважаючи на видатні здібності та красномовство, він прагнув тихого,
        аскетичного життя, зосередженого на молитві й богоспогляданні. Григорій
        часом дотримувався обітниці мовчання, про що писав:
      </p>
      <blockquote className={css.quote}>
        «Тоді заспівають лебеді, коли замовкнуть ґави».
      </blockquote>

      <figure className={css.videoPloat}>
        <iframe
          className={css.videoFrame}
          src="https://www.youtube.com/embed/Tii3-dQzfHI"
          title="Григорій Богослов — Цитати "
          allowFullScreen
        />

        <figcaption className={css.caption}>
          Григорій Богослов — Цитати
        </figcaption>
      </figure>

      {/* <h2>Чому його називають Богословом</h2> */}
      <p>
        Із багатьох Отців Церкви лише троє носять титул “Богослов”, і Григорій —
        один із них. Це не просто почесне звання, а визнання його глибокого
        духовного досвіду і вказує на його проникнення в богословське розуміння
        божественних речей.
      </p>
      <p>Він говорив:</p>
      <blockquote className={css.quote}>
        “Про Бога слід говорити не всім, не завжди і не про все, а лише тим, хто
        очистив розум і серце.”
      </blockquote>
      <blockquote className={css.quote}>
        “ Усi ангели разом не мають такої влади, яку має священик, бо не можуть
        вiдпустити нi одного грiха. А вже найбiльша священнича гiднiсть у тому,
        що на слова священика в Службi Божiй Христос сходить на землю“
      </blockquote>
      <blockquote className={css.quote}>
        “Хто навчився мовчати, той вмiє розумно говорити“
      </blockquote>
      <blockquote className={css.quote}>
        “Краще нехай мовчить язик, ніж говорить серце, не очищене покаянням.”
      </blockquote>

      <blockquote className={css.quote}>
        “Справжній піст — це віддалення від зла, стриманість язика і примирення
        з ближнім.”
      </blockquote>

      <blockquote className={css.quote}>
        “Пам’ятай Бога частіше, ніж дихаєш, і тоді твоє життя стане
        богослов’ям.”
      </blockquote>
<h2 className={css.headerLink}><a href="https://parafia.org.ua/biblioteka/svyatoottsivski-tvory/hryhorij-bohoslov-povne-zibrannya-tvorin/svyatytel-hryhorij-bohoslov-virshi-bohoslovski-virshi-istorychni-epitafiji-nadpysannya/chastyna-i-virshi-bohoslovski-rozdil-i-virshi-dohmatychni/">Вірші Григорія Богослова</a></h2>
      <section className={css.nestedArticle}>
        <figure className={css.mediaFloat}>
          <Image
            src={ThreeSaints}
            alt="Три святителі: Василій Великий, Григорій Богослов, Іоан Золотоустий"
            width={560}
            height={420}
          />
          <figcaption className={css.caption}>
            Святитель Григорій Богослов (лівруч). Ікона храму прп. Серафима
            Саровського, Вінниця.
          </figcaption>
        </figure>
       
        <p>
          Святий Григорій був також талановитим поетом — до нас дійшли сотні
          його віршів. 
        </p>

        <h3 className={css.headerPoetry}>Пісня Богові</h3>
        <p>
          О Ти, Який вище за все! Бо що інше дозволено мені промовити про Тебе?
          Як оспіває Тебе слово? Бо Ти, невимовний ніяким словом! Як подивиться
          на Тебе розум? Бо Ти незбагненний ніяким розумом. Ти один невимовний,
          бо звершив усе, що промовляється словом! 5. Ти один незбагненний, бо
          створив усе, що обіймається думкою. Тебе оспівує гучно все словесне й
          безсловесне. Тебе вшановує все і обдароване, і не обдароване розумом!
          До Тебе спрямовані загальні всіх бажання; про Тебе вболівають усі
          серця; Тобі все возсилає моління. 10. Тобі все, що розуміє Твої
          помахи, виголошує безмовний піснеспів. Тобою єдиним усе перебуває. До
          Тебе все в сукупності прагне. Ти кінець усього; Ти єдиний і все; Ти ні
          єдиний, ні єдине, ні все. О Всеіменований! Як найменую Тебе, єдиного
          неіменованого? 15. Та і який небесний розум проникне крізь позахмарні
          покрови? Будь милосердним, о Ти, Який вище за все! Бо що інше
          дозволено мені виголосити про Тебе?
        </p>
        <h3 className={css.headerPoetry}>Подяка</h3>
        <p>
          Дякую Тобі Царю і Творцю всього, небо сповнене слави Твоєї, а вся
          земля — Твоєю премудрістю. Бог Слово — Син Твій створив усе. Твій Дух
          Святий життям усіх обдаровує. 5. Милостива до світу Божественна
          Тройця; будь милостива й до нас, Сине Божий за духом, і людина за
          плоттю, Який хресну смерть перетерпів як людина; на третій день врата
          пекла скрушив як Бог; кайдани смерті розірвавши, воскрес, 10. і роду
          смертних відновивши природу, оживотворив усе властиве нам, аби ми
          завжди оспівували Тебе — Безсмертного.
        </p>
      </section>

      <figure className={css.videoPloat}>
        <div>
          <iframe
            className={css.videoFrame}
            src="https://www.youtube.com/embed/kf8J3_BS-7w"
            // width=100%
            height="315"
            title="Молитва до трьох святителів: Василія Великого, Григорія Богослова та Іоана Золотоустого"
            allowFullScreen
          />
        </div>
        <figcaption className={css.caption}>
          Молитва до трьох святителів: Василія Великого, Григорія Богослова та
          Іоана Золотоустого.
        </figcaption>
      </figure>

      <p>
        Три святителі — Василій Великий, Григорій Богослов та Іоан Золотоустий —
        вшановуються разом як рівні учителі Церкви. Хоча вони жили у різний час
        і мали різні стилі проповіді, їхні стосунки в церковній традиції
        символізують єдність у вірі та богослов’ї. Василій і Григорій були
        близькими друзями ще з часів навчання в Афінах. Разом боролися проти
        аріанства та розробляли богослов’я Трійці. Іоан Золотоустий: жив трохи
        пізніше, але його проповіді та тлумачення Писання стали продовженням
        тієї ж традиції, яку заклали Василій і Григорій.
      </p>
      <p>
        Cвято Трьох Святителів символізує, що різні дари — богословська глибина,
        монаша дисципліна, красномовство — служать одній істині.
      </p>
    </article>
  );
}
