"use client";

import styles from "./page.module.css";
import JohnTheTheologian from "./images/john-the-theologian.jpg";
import Image from "next/image";
import { useState } from "react";

export default function JohnTheTheologianPage() {
  const [expanded, setExpanded] = useState(false);
  return (
    <div className={styles.container}>
      <h1 className={styles.mainHeader}>Браття, любімо один одного!</h1>
      <article className={styles.article}>
        <figure className={styles.mediaFloat}>
          <div className={styles.imageWrapper}>
            <Image
              src={JohnTheTheologian}
              alt="Ікона святого Іоана Богослова"
              fill
              sizes="(max-width: 768px) 100vw, 40vw"
            />
          </div>
          <figcaption className={styles.caption}>
            &quot;Іоан Богослов&quot;
          </figcaption>
        </figure>
        <div className={!expanded ? styles.preview : ""}>
          <h3 className={styles.historyHeader}>Історія</h3>

          <p className={styles.paragraph}>
            Святий Апостол і Євангелист Іоан Богослов був сином рибака Заведея і
            Саломії.{" "}
          </p>
          <p className={styles.paragraph}>
            Коли на Йордані з’являється пророк Іоан Хреститель, який хрестить
            людей, сповіщаючи про початок Судних часів, батько відпускає
            молодшого сина подивитися, що це за вчитель і послухати його
            проповідь. Згодом Апостол Іоан разом із своїм товаришем Андрієм
            Первозванним стають учнями Іоана Предтечі.
          </p>
          <p className={styles.paragraph}>
            В цей же час туди приходить хреститись і Спаситель Ісус Христос.
            Іоан Хреститель, поглянувши на Ісуса, сказав: “ось Агнець Божий”. І
            ці два учні пішли за Ісусом і пробули у нього той день. Так Іоан
            Богослов разом із Андрієм Первозванним познайомились із Христом,
            який, імовірно, звелів їм повертатися додому, займатися своїми
            справами та чекати того моменту, коли Він покличе їх із собою.
          </p>
          <p className={styles.paragraph}>
            Після сорокаденного посту в пустелі, Христос повертається на
            батьківщину і починає свою проповідь на берегах Галілейського озера.
            Саме тут, Іоан Богослов разом зі своїм старшим братом Яковом був
            покликаний Господом до числа своїх учнів. Залишивши свого батька,
            обидва брати пішли за Христом.
          </p>
          <p className={styles.paragraph}>
            Апостола Іоана особливо любив Спаситель за жертовну любов і велику
            чистоту. Після свого покликання Апостол не розлучався із Господом та
            був одним із трьох учнів, яких Господь брав на найважливіші моменти
            свого служіння. Так, Святий Іоан Богослов був присутній при
            воскресінні Господом дочки Яіра і Преображення Господнього на горі
            Фавор.
          </p>
          <p className={styles.paragraph}>
            Під час Таємної Вечері він возлежав поруч із Господом і за вказівкою
            Апостола Петра, припавши до грудей Спасителя, запитав про ім’я
            зрадника. Також, Апостол Іван йшов слідом за Господом, коли його
            зв’язаного вели з Гефсиманського саду на суд до первосвящеників Анни
            і Кайяфи. Перебував він також і в архієрейському дворі при допитах
            свого Учителя і невідступно слідував за ним хресним шляхом. Біля
            підніжжя Хреста він плакав разом із Божою Матір’ю і чув, звернені до
            Неї слова розп’ятого Господа: “Жінко, це син твій” і до нього: “Ось
            Мати твоя” (Ін. 19; 26, 27). З того часу Апостол Іоан, як люблячий
            син, дбав про Пресвяту Діву Марію і служив їй до її Успіння, нікуди
            не відлучаючись із Єрусалима.
          </p>
          <p className={styles.paragraph}>
            Після Успіння Божої Матері Апостол Іоан Богослов, згідно жеребу, що
            випав на нього, вирушає в Ефес (сучасна Туреччина) та інших
            малоазійських міст для проповіді Євангелія, беручи з собою свого
            учня Прохора.
          </p>

          <p className={styles.paragraph}>
            В цей час почалося гоніння християн імператором Нероном (56 – 68).
            Апостола Івана відвели на суд до Риму, де за сповідання віри в
            Господа Ісуса Христа він був засуджений до смерті, проте Господь
            зберіг свого обранця: Апостол випив дану йому чашу зі смертельною
            отрутою та залишився живим. Згодом, вийшов неушкодженим із котла з
            киплячою олією, у яку був укинутий за на казом мучителя.
          </p>
          <p className={styles.paragraph}>
            Після цього Апостола Іоана заслали в ув’язнення на острів Патмос, де
            він прожив багато років. Проповідь євангелії супроводжувалася
            чудесами та привернула до нього всіх мешканців острова. Тут він
            виганяв бісів із капищ і зціляв багатьох хворих. Близько 67 року на
            цьому острові була написана Книга Об’явлення (Апокаліпсис) Святого
            Апостола Іоана Богослова.
          </p>
          <p className={styles.paragraph}>
            Після тривалого заслання Апостол Іоан отримав свободу та повернувся
            в Ефес, де продовжував свою діяльність, навчаючи християн
            остерігатися лжеучителів та їх лжевчень. Близько 95 року Апостол
            Іван Богослов написав Євангеліє.
          </p>
          <p className={styles.paragraph}>
            Св. Іоан постійно повторював проповідь: <span className={styles.quoteToHeader}>«Браття, любімо один
            одного!»</span> Ця тема постійно повторюється в його писаннях. За
            переказами, Іван попросив учнів віднести його за місто Єфес і
            поховати в домовині у формі Хреста. Коли він ліг у домовину,
            попросив учнів накрити його землею. Учні поцілували вчителя зі
            сльозами на очах, але не хотіли бути йому непослушними. Покрили його
            обличчя полотном, а потім вкрили землею. Коли ж на похорон прийшли
            інші учні, вони хотіли побачити Апостола, але, відкривши домовину,
            побачили її порожньою. Відтоді День Його Упокоєння іноді називають
            Днем його Переселення з землі на Небо.{" "}
          </p>
          <p className={styles.paragraph}>
            Могила Святого Апостола Івана стала місцем паломництва місцевих
            християн. Коли гоніння припинились, тут був побудований храм. В VI
            столітті на цьому місці був зведений великий Собор. В день пам’яті
            Апостола, з могили піднімався в повітря і осідав тонкий
            пил (т. зв. “прах”). У ці дні тут бувало особливо велике скупчення
            прочан. Вони приходили, щоб доторкнутися до святої гробниці і
            скуштувати священного праху. Про це пишуть багато очевидців тих
            часів. 
          </p>
          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}></p>
        </div>
        <button
          className={styles.readMore}
          onClick={() => setExpanded(!expanded)}
        >
          {expanded ? "Згорнути..." : "Читати далі..."}
        </button>
      </article>
      <article className={styles.article}>
        {" "}
        <blockquote className={styles.gospel}>
          <h3 className={styles.gospelTitle}>Євангеліє від Іоана 19:25-27</h3>25 Біля хреста Ісуса стояли Мати Його і сестра Матері Його, Марія Клеопова, і Марія Магдалина. 26 Ісус, побачивши Матір і ученика, що тут стояв, якого любив, говорить до Матері Своєї: Жоно! Це — син Твій. 27 Потім каже ученикові: це — Мати твоя! І з цього часу ученик взяв Її до себе.
        </blockquote>
      </article>
      <article className={styles.article}></article>
      <article className={styles.article}></article>
    </div>
  );
}
