"use client";

import { useState } from "react";
import Image from "next/image";
import styles from "./page.module.css";
import MaryOfEgypt from "./images/MaryOfEgypt.jpg";

export default function MariaYehypetska() {
  const [expanded, setExpanded] = useState(false);

  return (
    <div className={styles.container}>
      <article className={styles.article}>
        <figure className={styles.mediaFloat}>
          <div className={styles.imageWrapper}>
            <Image
              src={MaryOfEgypt}
              alt="Ікона святої Марії Єгипетської"
              fill
              sizes="(max-width: 768px) 100vw, 40vw"
            />
          </div>
          <figcaption className={styles.caption}>
            Свята Марія Єгипетська зі сценами житія (ікона XVIII століття)
          </figcaption>
        </figure>
        <div className={!expanded ? styles.preview : ""}>
          <h3 className={styles.historyHeader}>Історія</h3>
          <p className={styles.paragraph}>
            Преподобна Марія жила в кінці V – на почату VI століття в
            Олександрії та вже в 12-літньому віці втекла з рідного дому. Будучи
            без батьківського нагляду, вона захопилась розпусним способом життя,
            спокушаючи на гріховну дорогу безліч молодих людей. Так Марія
            прожила 17 років свого життя, поки Господь не навернув її до
            покаяння.
          </p>
          <p className={styles.paragraph}>
            Одного разу, гуляючи берегом моря, Марія побачила корабель, що
            вирушав із паломниками в Палестину на свято Воздвиження Хреста
            Господнього. Вона бачила, що на кораблі було багато молодих людей і
            вирішила піднятися на корабель, щоб спокушати їх.
          </p>
          <p className={styles.paragraph}>
            Після прибуття в Палестину, усі паломники зійшли з корабля та пішли
            в Єрусалим. За ними вирушила й Марія Єгипетська, бажаючи увійти
            разом з усіма до Храму Воскресіння Христового, але далі за притвор
            не могла ступити, оскільки якась невидима сила відштовхувала її та
            не дозволяла увійти до храму. Так тричі намагалася вона увійти,
            проте жодного разу не виходило.
          </p>
          <p className={styles.paragraph}>
            В цей час благодать Божа просвітила її розум і серце й вона
            зрозуміла, що її життя розпусним та що власні гріхи не впускають до
            храму. Піднявши очі, Марія побачила ікону Божої Матері та слізно
            почала благати Пресвяту Богородицю, щоб дозволила їй увійти у храм:
            „О, Мати Божа! Дозволь мені підійти й поклонитись Животворчому
            Христу. Я обіцяю більше не грішити”.
          </p>
          <p className={styles.paragraph}>
            Після цього Марія спокійно увійшла в храм та поклонилася Святому
            Хресту. Вийшовши, дякувала Матері Божій за отриману благодать і
            просила поради куди прямувати далі. Саме в цей час почула тихий
            голос: „Йди за Йордан і там знайдеш спокій”.
          </p>
          <p className={styles.paragraph}>
            Марія повірила, що невидимий голос стосується саме її, і плачучи
            сказала: „Владичице Богородице, не покидай мене”. Так Марія
            Єгипетська назавжди залишила безсоромне життя.
          </p>
          <p className={styles.paragraph}>
            Якийсь перехожий, побачивши її сльози, дав три срібні монети. На них
            вона купила три хлібини і в продавця дізналася дорогу,яка веде на
            Йордан. Так Марія дійшла до храму в честь Святого Іоана Хрестителя
            на березі ріки. Там вона відпочила, вмилася в річці. Наступного дня
            причастилася в храмі й поїла хліба. Того ж дня човном переправилася
            на другий беріг ріки та пішла за повелінням Богородиці далеко-далеко
            в пустиню.{" "}
          </p>
          <p className={styles.paragraph}>
            Повне усамітнення, молитва, піст, сльози, терпіння негараздів і бід
            перетворили її у праведницю. Сорок вісім років жила вона в пустелі і
            померла близько 421 року.{" "}
          </p>
          <p className={styles.paragraph}>
            «Стояння Марії Єгипетськїй», коли в храмах читається Великий
            покаянний канон Андрія Критського і житіє преподобної Марії, буває в
            четвер, напередодні 5-ої неділі Великого посту.{" "}
          </p>

          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}></p>
        </div>
        <button
          className={styles.readMore}
          onClick={() => setExpanded(!expanded)}
        >
          {expanded ? "Згорнути..." : "Читати далі..."}
        </button>
      </article>
    </div>
  );
}
