import style from "./page.module.css";

export default function LivesPage() {
  return (
    <main className={`${style.livesMain} container`}>
      <div>
        {/* <h2>Святість у православній традиції</h2> */}
        <p>
          У православному християнстві святість розуміється як особливий стан
          єдності з Богом, чистоти та відокремленості від гріха. Святі — це
          люди, які своїм життям, вірою та подвигами засвідчили праведність і
          стали прикладом для інших. Теоретично кожен християнин може стати
          святим, але це вимагає цілого життя духовної боротьби, благочестя та
          вірності Христу.
        </p>
        <ul>
          <li>Святість — це властивість Бога.</li>
        </ul>

        <blockquote className={style.gospel}>
          <h3 className={style.gospelTitle}>Євангеліє від Матвія 5:48</h3>«Отож
          будьте досконалі, як досконалий Отець ваш Небесний».
        </blockquote>
        <blockquote className={style.gospel}>
          <h3 className={style.gospelTitle}>Євангеліє від Луки 1:75</h3>«Щоб ми
          служили Йому в святості й праведності перед Ним по всі дні життя
          нашого».
        </blockquote>

        <h3>Святі це</h3>
        <ul>
          <li>
            Люди, яких Церква особливо шанує за віру, праведність чи мучеництво.
          </li>
          <li>
            Вони не є об’єктом поклоніння, але їх просять молитовно заступатися.
          </li>
          <li>В іконографії святі зображуються з німбом.</li>
        </ul>

        <h3>Хто може стати святим -</h3>
        <ul>
          <li>Кожен християнин покликаний до святості.</li>
          <li>
            Святими стають ті, хто живе у вірності Христу, проявляє милосердя та
            жертовність.
          </li>
          <li>Іноді через мучеництво або чудотворіння.</li>
        </ul>

        <blockquote className={style.quote}>
          «Святість не в тому, щоб уникати світу, а в тому, щоб жити в світі й
          не бути від світу».
          <br />— святитель Іоан Золотоустий
        </blockquote>

        <blockquote className={style.quote}>
          «Святість — це життя у Христі, яке проявляється в любові до Бога і
          ближнього».
          <br />— святитель Василій Великий
        </blockquote>

        <blockquote className={style.quote}>
          «Стяжи мирний дух, і тисячі навколо тебе спасуться».
          <br />— Преподобний Серафим Саровський
        </blockquote>

        <blockquote className={style.quote}>
          «Християнин — той, хто носить святість у серці й ділах, бо він носить
          Христа».
          <br />— Святий Ігнатій Богоносець
        </blockquote>

        <p>
          Отже — це не абстрактний ідеал, а реальний шлях, відкритий кожному
          християнину. Святим може стати будь-хто, хто проживе життя у вірності
          Христу, любові до ближніх і духовній чистоті.
        </p>
      </div>
    </main>
  );
}
