import style from "./page.module.css";

export default function FassPage() {
  return (
    <main className={`${style.fastsMain} container`}>
      <h1 className={style.fastsHeader}>Пости</h1>

      <p>
        Піст у православній традиції — це не лише утримання від певної їжі, а
        насамперед духовний шлях очищення, покаяння та внутрішнього
        зосередження.
      </p>
      <blockquote className={style.gospel}>
        <h3 className={style.gospelTitle}>Євангеліє від Матфея 6:16-18</h3>«
        Коли ж постите, не будьте сумні, як лицеміри, бо вони потьмарюють
        обличчя свої, щоб показати людям, що постять вони. Істинно кажу вам:
        вони вже мають нагороду свою. Ти ж, коли постиш, намасти голову твою і
        вмий обличчя твоє, щоб не показувати людям, що ти постиш, але Отцю
        твоєму, — Який у таїні; і Отець твій, Який бачить таємне, воздасть тобі
        явно.»
      </blockquote>

      <p>
        Християнський піст має глибоке біблійне коріння. Сам Ісус Христос
        постився сорок днів у пустелі перед початком Свого служіння. Піст у
        Церкві — це відповідь людини на Божу любов, добровільне обмеження заради
        духовного зростання.
      </p>
      <blockquote className={style.gospel}>
        <h3 className={style.gospelTitle}>Євангеліє від Матфея 17:21</h3>
        «Цей же рід виганяється тільки молитвою та постом»
      </blockquote>

      <p>
        Тому піст завжди поєднується з молитвою, милосердям і стриманістю в
        словах та вчинках. Без цього він перетворюється лише на формальну дієту.
      </p>

      <p>
        Пости поділяються на багатоденні та одноденні. Вони пов’язані з
        ключовими подіями євангельської історії та церковного року.
      </p>

      {/* ===================== */}
      <h3 className={style.fastsHeader}>Багатоденні пости</h3>

      <ul>
        <li>
          <strong>Великий піст</strong> — найсуворіший і найтриваліший, готує
          вірних до свята Воскресіння Христового (Пасхи).
          <br /> Час: 7 тижнів перед Пасхою (дата змінна)
          <br />
          Особливість: найсуворіший піст, що наслідує 40-денний піст Ісуса
          Христа в пустелі
        </li>

        <li>
          <strong>Петрів піст</strong> — встановлений на честь апостолів Петра і
          Павла. <br /> Час: після Неділі Всіх Святих до дня святих апостолів
          Петра і Павла (29 червня)
          <br />
          Особливість: тривалість залежить від дати Пасхи
        </li>

        <li>
          <strong>Успенський піст</strong> — присвячений Пресвятій Богородиці.{" "}
          <br />
          Час: 1–14 серпня
          <br />
          Особливість: короткий, але суворий, за духом подібний до Великого
          посту
        </li>

        <li>
          <strong>Різдвяний піст</strong> — готує до свята Різдва Христового (25
          грудня) <br />
          Час: 15 листопада – 24 грудня (новий стиль)
          <br />
          Особливість: поєднує стриманість із радісним очікуванням Втілення
          Христа
        </li>
      </ul>

      {/* ===================== */}
      <h3 className={style.fastsHeader}>Одноденні пости</h3>

      <ul>
        <li>
          <strong>Навечір’я Богоявлення</strong> — 5 січня
          <br />
          Подія: Хрещення Господнє
          <br />
          Сенс: духовне очищення перед великим святом
        </li>

        <li>
          <strong>Усікновення глави Іоана Хрестителя</strong> — 29 серпня
          <br />
          Подія: мученицька смерть пророка
          <br />
          Сенс: пам’ять про покаяння та стриманість
        </li>

        <li>
          <strong>Воздвиження Чесного і Животворчого Хреста</strong> — 14
          вересня
          <br />
          Подія: прославлення Хреста Господнього
          <br />
          Сенс: нагадування про жертву Христа
        </li>

        <li>
          <strong>Щосереди та щоп’ятниці</strong>
          <br />
          Пісні дні протягом усього року (крім суцільних седмиць) на згадку про
          зраду Юди (середа) та розп&apos;яття Христа (п&apos;ятниця).
        </li>
        <li>
          <strong>Євхаристійний піст</strong>
          <br />
          Утримання від їжі та води (зазвичай від опівночі) перед прийняттям
          Святих Таїн (причастям)
        </li>
      </ul>

      {/* ===================== */}

      {/* <h3 className={style.headerQuote}>Святі отці казали:</h3> */}

      <blockquote className={style.quote}>
        «Істинний піст — це віддалення від зла, стримання язика, відкинення
        гніву, віддалення від похотей»
        <br />— святитель Василій Великий
      </blockquote>

      <blockquote className={style.quote}>
        «Як нестримність у їжі буває причиною і джерелом численних бід для роду
        людського, так і піст — зневажання плотських насолод — завжди був
        причиною невимовних благ»
        <br />— святитель Іоан Золотоустий
      </blockquote>

      <blockquote className={style.quote}>
        «Піст - колісниця, що виводить на небо. Піст - мати здоров’я »
        <br />— Прп. Ісаак Сирін
      </blockquote>

      <blockquote className={style.quote}>
        «Не той піст приємний Богові, що утримує уста, а той, що очищає серце»
        <br />— святитель Іоан Золотоустий
      </blockquote>
    </main>
  );
}
