import styles from "./page.module.css";

export default function Memorial() {
  return (
    <div className={`${styles.main} container`}>
      <h1 className={styles.title}>Поминальні дні</h1>
      <section>
        <p className={styles.paragraph}>
          Поминальні дні мають особливе значення для духовного життя громади:
          вони нагадують про необхідність молитви за спочилих, єднають живих і
          померлих у Христі, утверджують віру у Христове воскресіння та любов,
          яка не переривається навіть смертю.
        </p>

        <p className={styles.quote}>
          «Не залишаймо тих, що відійшли, без допомоги; приносімо за них молитви
          і милостиню».
          <br />— святитель Іоан Золотоустий
        </p>
        <p className={styles.quote}>
          «Молитва за померлих приносить їм користь, навіть якщо вони не могли
          самі принести плоди покаяння» .
          <br />— святитель Василій Великий
        </p>
      </section>
      <section>
        {" "}
        <h2 className={styles.subtitle}>Батьківські поминальні суботи</h2>
        <ul className={styles.list}>
          <li className={styles.listItem}>
            <strong>М’ясопусна субота</strong> – перед неділею про Страшний суд,
            за два тижні до Великого посту.
          </li>
          <li className={styles.listItem}>
            <strong>2-а, 3-я та 4-а суботи Великого посту</strong> – особливі
            дні молитви за спочилих.
          </li>
          <li className={styles.listItem}>
            <strong>Троїцька субота</strong> – напередодні свята П’ятидесятниці.
          </li>
          <li className={styles.listItem}>
            <strong>Дмитрівська субота</strong> – перед днем святого
            великомученика Димитрія Солунського (26 жовтня).
          </li>
        </ul>
        <h2 className={styles.subtitle}>Інші поминальні дні</h2>
        <ul className={styles.list}>
          <li className={styles.listItem}>
            <strong>Радониця</strong> – у вівторок після Пасхальної седмиці.
          </li>
          <li className={styles.listItem}>
            <strong>Поминання жертв Голодоморів в Україні</strong> – в четверту
            суботу листопада.
          </li>
        </ul>
        <h2 className={styles.subtitle}>Значення поминальних днів</h2>
        <p className={styles.paragraph}>
          Молитва за спочилих є проявом любові та милосердя, адже душа після
          смерті вже не може сама змінити свій стан, але молитви живих можуть
          допомогти їй.
        </p>
        <p className={styles.paragraph}>
          Поминальні дні утверджують єдність Церкви – живі й померлі складають
          одну спільноту у Христі.
        </p>
        <p className={styles.paragraph}>
          Вони нагадують про слова апостола Павла: <br />
          <em>
            «Бо коли ми вiруємо, що Ісус помер i воскрес, то й померлих в Iсусi
            Бог приведе з Hим»
          </em>
          (1 Сол. 4:14).
        </p>
      </section>
      <section>
        <h2 className={styles.subtitle}>Заупокійні служби</h2>
        <ul className={styles.list}>
          <li className={styles.listItem}>
            <strong>Парастас</strong>
            <ul className={styles.subList}>
              <li className={styles.subListItem}>
                Велика заупокійна служба, яка включає більше молитов, псалмів і
                співів ніж панахида.
              </li>
              <li className={styles.subListItem}>
                Особливо урочисте поминання, часто у батьківські суботи чи на
                великі поминальні дні.
              </li>
              <li className={styles.subListItem}>
                Використовується для поминань на 9-й, 40-й день після смерті, у
                річниці.
              </li>
            </ul>
          </li>

          <li className={styles.listItem}>
            <strong>Панахида</strong>
            <ul className={styles.subList}>
              <li className={styles.subListItem}>
                Скорочена форма заупокійної служби, яка складається з молитов,
                псалмів і співів за душу померлого.
              </li>
              <li className={styles.subListItem}>
                Вона значно коротша за парастас, може служитися після Літургії
                або окремо.
              </li>
            </ul>
          </li>

          <li className={styles.listItem}>
            <strong>Записки «за упокій»</strong>
            <ul className={styles.subList}>
              <li className={styles.subListItem}>
                Це традиція подавати імена спочилих для поминання в храмі під
                час Літургії.
              </li>
              <li className={styles.subListItem}>
                Священик читає імена під час Богослужіння, молячись за кожного.
              </li>

              <li className={styles.subListItem}>
                Призначається для особистого поминання рідних і близьких у
                храмі.
              </li>
            </ul>
          </li>
        </ul>
      </section>

      <section className={styles.section}>
        <h2 className={styles.subtitle}>Як замовити поминальну службу</h2>
        <p className={styles.paragraph}>
          У православній традиції віряни можуть замовити
          <strong>парастас</strong> або <strong>панахиду</strong> для молитви за
          спочилих. Це робиться через подання записки «за упокій» та приношення
          дарів.
        </p>

        <h3 className={styles.subsubtitle}>Кроки для замовлення</h3>
        <ol className={styles.list}>
          <li className={styles.listItemSteps}>
            <strong>Напишіть записку «за упокій»</strong> — імена спочилих у
            родовому відмінку (наприклад: «Івана, Марії»).
          </li>
          <li className={styles.listItemSteps}>
            <strong>Передайте записку</strong> священику або в церковну
            канцелярію перед службою. <br />
            <p>
              <strong>Принесення дарів</strong>: конкретних церковних вимог щодо
              цього немає. Головне, з чим маємо прийти до храму – це з молитвою,
              з любов’ю і потребою у спілкуванні з Богом. Відсутність можливості
              купити певні продукти або пожертвувати щось не є перешкодою для
              звершення поминальної служби.
            </p>
            <p>
              Традиційно за бажанням люди приносять на поминальну службу певні
              продукти (хліб, воду, крупу, борошно, вино, олію, печиво, солодощі
              тощо) і кладуть це на панахидний стіл.
            </p>
          </li>

          <li className={styles.listItemSteps}>
            <strong>Будьте присутні</strong> на службі та моліться разом із
            громадою.
          </li>
        </ol>
      </section>

      {/* <article className={styles.nestedArticle}>
        <h2 className={styles.subtitle}>
          Заупокійна літія, що звершується мирянином вдома і на кладовищі
        </h2>

        <p>В ім’я Отця, і Сина, і Святого Духа. Амінь.</p>
        <p>
          Господи Ісусе Христе, Сину Божий, молитвами Пречистої Твоєї Матері і
          всіх святих помилуй нас. Амінь.
        </p>
        <p>Слава Тобі, Боже наш, слава Тобі.</p>
        <p>
          Царю Небесний, Утішителю, Душе істини, що всюди єси і все наповняєш,
          Скарбе добра і життя Подателю, прийди і вселися в нас, і очисти нас
          від усякої скверни, і спаси, Благий, душі наші.
        </p>
        <p>Святий Боже, Святий Кріпкий, Святий Безсмертний, помилуй нас.</p>
        <p>Святий Боже, Святий Кріпкий, Святий Безсмертний, помилуй нас.</p>
        <p>Святий Боже, Святий Кріпкий, Святий Безсмертний, помилуй нас.</p>
        <p>
          Слава Отцю, і Сину, і Святому Духові нині, і повсякчас, і на віки
          віків. Амінь.
        </p>
        <p>
          Пресвята Тройце, помилуй нас; Господи, очисти гріхи наші; Владико,
          прости беззаконня наші; Святий, зглянься і зціли немочі наші імені
          Твого ради.
        </p>
        <p>Господи, помилуй.</p>
        <p>Господи, помилуй.</p>
        <p>Господи, помилуй.</p>

        <p>
          Слава Отцю, і Сину, і Святому Духові нині, і повсякчас, і на віки
          віків. Амінь.
        </p>
        <p>
          Отче наш, що єси на небесах, нехай святиться ім’я Твоє; нехай прийде
          Царство Твоє; нехай буде воля Твоя, як на небі, так і на землі. Хліб
          наш насущний дай нам сьогодні; і прости нам провини наші, як і ми
          прощаємо винуватцям нашим; і не введи нас у спокусу, але визволи нас
          від лукавого. Бо Твоє є Царство, і сила, і слава, Отця, і Сина, і
          Святого Духа, нині, і повсякчас, і на віки віків. Амінь.
        </p>
        <p>Прийдіте, поклонімся Цареві нашому Богу[Поклін]</p>
        <p>
          Прийдіте, поклонімся і припадем Христу́, Цареві нашому Богу. [Поклін]
        </p>
        <p>
          Прийдіте, поклонімся і припадем Самому Христу́, Цареві і Богу нашому.
          [Поклін]
        </p>
      </article> */}
    </div>
  );
}
