import styles from "./page.module.css";

export default function PalmSundayPage() {
  return (
    <div>
      <article className={styles.article}>
        <section>
          <p className={styles.paragraph}>
            Вербна неділя — шоста неділя Великого Посту, яка припадає за 7 днів
            до Великодня. Великий Тиждень, який ще називається Страсним,
            розпочинається Вербною неділею
          </p>
          <p className={styles.paragraph}>
            День Вербної неділі нагадує християнам урочистий вхід Ісуса Христа в
            Єрусалим, який знаменував собою безпосереднє наближення Його
            Страстей і смерті на хресті. Люди, які Його вітали, кидали на дорогу
            плащі та зелені галузки пальм, вигукуючи: «Осанна Синові Давида!».
          </p>
          <p className={styles.paragraph}>
            У слов’янській традиції замість пальмових гілок використовують
            вербу, оскільки саме вона найпершою пробуджується до життя після
            зими. Тому в українській церковній традиції це свято отримало назву
            Вербна неділя.
          </p>
          <p></p>
          <p></p>
        </section>
        {/* <section className={styles.gospel}>
          <h3 className={styles.gospelTitle}>Євангеліє від Луки 1:26–38</h3>

          <p></p>
        </section>
        <section>
          <h3>Святитель Іоан Золотоустий:</h3>

          <blockquote className={styles.quote}>
            Дух Святий засяяв в чистому дзеркалі, в непорочному тілі Діви,
            утворивши досконалу Людину не по закону природи, не в часі, не з
            людського насіння, але одним видом, духовною і святою силою спонукав
            Діву до народження, невимовно виткавши в Ній Зародок, як би яку
            тканину для спасіння людей.
          </blockquote>

          <h3>Святитель Григорій Палама:</h3>

          <blockquote className={styles.quote}>
            Діва-Мати є наче єдиною межею між створеним і нествореним Божеським
            єством. І усі, хто бачити Бога пізнають і Її — як місце
            Невмістимого. І всі, які вихваляють Бога заспівають і Її після Бога.
            Вона причина благословень і дарів людського роду, які були перед
            нею, і Подателька теперішніх (дарів), і Заступниця — вічних (дарів).
            Вона — основа пророків, початок апостолів, утвердження мучеників,
            фундамент вчителів. Вона — слава тих що на землі, радість тих що на
            небі, прикраса всього творіння. Вона — початок, джерело і корінь
            надії, що уготована нам на небесах, щоб змогли ми всі отримати
            (надію) за її молитвам за нас.
          </blockquote>
        </section>
        <section>
          <div className={styles.block}>
            <h2>Тропар свята Благовіщення Пресвятої Богородиці</h2>
            <div className={styles.flex}>
              <div className={styles.textSide}>
                <p className={styles.textSide}>
                  Сьогодні спасіння нашого початок
                  <br />
                  і від віку таїнства явлення:
                  <br />
                  Син Божий стає Сином Діви,
                  <br />
                  і Гавриїл благодать благовістить.
                  <br />
                  Тому й ми з ним до Богородиці взиваємо:
                  <br />
                  радуйся, благодатна, Господь з Тобою.
                </p>
              </div>
              <div>
                <figure className={styles.videoSide}>
                  <iframe
                    className={styles.videoFrame}
                    src="https://www.youtube.com/embed/Ms3jUd-v4U4   "
                    title="Тропар свята Благовіщення Пресвятої Богородиці"
                    loading="lazy"
                    allowFullScreen
                  />
                  <figcaption className={styles.caption}>
                    Тропар свята Благовіщення Пресвятої Богородиці. Юлія Хмара
                  </figcaption>
                </figure>
              </div>
            </div>
          </div>

          <div className={styles.block}>
            <h2>Радуйся, Маріє! Пісня на Благовіщення Пресвятої Богородиці.</h2>
            

            <div className={styles.flex}>
              <div className={styles.textSide}>
                <p className={styles.textSide}>
                  Благовіщення день світлий
                  <br />
                  Нині Небо співає
                  <br />
                  До Пречистоі Діви
                  <br />
                  Ангел Божий промовляє:
                  <br />
                  <br />
                  Радуйся, Маріє, я перед Тобою.
                  <br />
                  Радуйся, Маріє, Господь з Тобою.
                  <br />
                  Радуйся, Маріє, повна благодати.
                  <br />
                  Радуйся, Маріє, Божая Мати!
                  <br />
                  <br />
                  Вшанувати Матір Божу
                  <br />
                  Ми до храму поспішаєм,
                  <br />
                  Богородице Маріє,
                  <br />
                  Всі до Тебе прибігаєм.
                  <br />
                  Ти моли за нас, Маріє
                  <br />
                  Христа Бога, Твого сина,
                  <br />
                  Щоб збулася наша мрія,
                  <br />
                  Щоб розквітла Україна!
                  <br />
                  <br />
                  Просим перемоги й миру,
                  <br />
                  Просим світла і любові,
                  <br />
                  Хай живе молитва й віра
                  <br />
                  В кожнім серці, в кожнім домі.
                  <br />
                  Молим Тебе, Мати Божа,
                  <br />
                  припадаєм на коліна…
                  <br />
                  Хай добро переможе,
                  <br />
                  Хай воскресне Україна!
                </p>
              </div>
              <div>
                <figure className={styles.videoSide}>
                  <iframe
                    className={styles.videoFrame}
                    src="https://www.youtube.com/embed/gke_Vf_mcc8 "
                    title="Радуйся, Маріє! Пісня на Благовіщення Пресвятої Богородиці."
                    loading="lazy"
                    allowFullScreen
                  />
                  <figcaption className={styles.caption}>
                    Радуйся, Маріє! Пісня на Благовіщення Пресвятої Богородиці.
                    Юлія Хмара
                  </figcaption>
                </figure>
              </div>
            </div>
          </div>
        </section> */}
        {/* <section>
          <p>
            Благовіщення Пресвятої Богородиці — одне з найшанованіших
            християнських свят, яке за значимістю поступається лише Великoдню та
            Різдву. Цей день – рівно за 9 місяців до свята Різдва Христового, 25
            грудня.
          </p>
        </section> */}
      </article>
    </div>
  );
}
