import styles from "./page.module.css";

export default function AnnunciationPage() {
  return (
    <div>
      <article className={styles.article}>
        <section>

          <p>
            Благовіщення означає «блага» або «добра» звістка. У цей день Діві
            Марії явився Архангел Гавриїл і сповістив Їй про прийдешнє
            народження Ісуса Христа — Сина Божого і Спасителя світу.
          </p>
          <p>
            До 14 років Пресвята Діва виховувалася в храмі, а потім, згідно із
            законом, повинна була залишити храм, як повнолітня, і або
            повертатися до батьків, або взяти шлюб. Священники хотіли видати її
            заміж, але Марія оголосила їм про свою обіцянку Богові — залишитися
            назавжди Дівою. Тоді священники заручили Її з далеким родичем,
            вісімдесятирічним старцем Йосифом, щоб він піклувався про Неї і
            охороняв Її дівоцтво. Живучи в Галілейському місті Назареті, в
            будинку Йосифа, Пресвята Діва Марія вела таке ж скромне і
            відокремлене життя, як і при храмі.
          </p>
          <p>
            Через чотири місяці після заручин, Ангел явився Марії, коли Вона
            читала Священне Писання і, увійшовши до неї, сказав: « радуйся,
            благодатна Маріє, Господь з Тобою. Благословенна Ти між жонами».
            Архангел Гавриїл сповістив Їй, що Вона сподобилася найбільшої
            благодаті у Бога — бути Матір’ю Сина Божого.
          </p>
          <p>
            Марія в подиві запитала Ангела, як може народитися син у тієї, яка
            не знала чоловіка. І тоді Архангел відкрив Їй істину, принесену від
            Всемогутнього Бога: «Дух Святий зійде на Тебе, і cила Всевишнього
            осінить Тебе. Тому і народжуване Святе наречеться Сином Божим».
            Збагнувши волю Божу і цілком віддаючи Себе їй, Пресвята Діва
            відповідала: « Я — раба Господня. Нехай буде Мені за словом твоїм».
          </p>
          <p></p>

          <section className={styles.gospel}>
            <h3 className={styles.gospelTitle}>Євангеліє від Луки 1:26–38</h3>

            <p>
              26 Шостого ж місяця був посланий від Бога ангел Гавриїл у
              галилейське місто, яке називається Назарет, 27 до Діви, зарученої
              з мужем на ім’я Йосиф, з дому Давидового; ім’я ж Діви — Марія. 28
              Ангел, увійшовши до Неї, сказав: радуйся, Благодатна! Господь з
              Тобою, благословенна Ти в жонах. 29 Вона ж, побачивши його,
              стривожилася від слів його і міркувала, що б то значило це
              привітання. 30 І сказав Їй ангел: не бійся, Маріє! Бо Ти знайшла
              благодать у Бога. 31 І ось зачнеш в утробі і народиш Сина, і
              наречеш ім’я Йому Ісус. 32 Він буде Великий і Сином Всевишнього
              наречеться, і дасть Йому Господь Бог престіл Давида, отця Його. 33
              І царюватиме у домі Якова повік, і царству Його не буде кінця. 34
              Марія ж сказала ангелу: як же станеться це, коли Я мужа не знаю?
              35 Ангел сказав Їй у відповідь: Дух Святий зійде на Тебе, і cила
              Всевишнього осінить Тебе. Тому і народжуване Святе наречеться
              Сином Божим. 36 Ось і Єлисавета, родичка Твоя, і вона зачала сина
              в старості своїй, і це вже шостий місяць їй, хоча називають її
              неплідною, 37 бо не буває безсилим у Бога ніяке слово. 38 Тоді
              Марія сказала: Я — раба Господня. Нехай буде Мені за словом твоїм.
              І відійшов від Неї ангел.
            </p>
          </section>

          <h3>Святитель Іоан Золотоустий:</h3>

          <blockquote className={styles.quote}>
            Дух Святий засяяв в чистому дзеркалі, в непорочному тілі Діви,
            утворивши досконалу Людину не по закону природи, не в часі, не з
            людського насіння, але одним видом, духовною і святою силою спонукав
            Діву до народження, невимовно виткавши в Ній Зародок, як би яку
            тканину для спасіння людей.
          </blockquote>

          <h3>Святитель Григорій Палама:</h3>

          <blockquote className={styles.quote}>
            Діва-Мати є наче єдиною межею між створеним і нествореним Божеським
            єством. І усі, хто бачити Бога пізнають і Її — як місце
            Невмістимого. І всі, які вихваляють Бога заспівають і Її після Бога.
            Вона причина благословень і дарів людського роду, які були перед
            нею, і Подателька теперішніх (дарів), і Заступниця — вічних (дарів).
            Вона — основа пророків, початок апостолів, утвердження мучеників,
            фундамент вчителів. Вона — слава тих що на землі, радість тих що на
            небі, прикраса всього творіння. Вона — початок, джерело і корінь
            надії, що уготована нам на небесах, щоб змогли ми всі отримати
            (надію) за її молитвам за нас.
          </blockquote>

          <div className={styles.block}>
            <h2>Тропар свята Благовіщення Пресвятої Богородиці</h2>
            <div className={styles.flex}>
              <div className={styles.textSide}>
                <p className={styles.textSide}>
                  Сьогодні спасіння нашого початок
                  <br />
                  і від віку таїнства явлення:
                  <br />
                  Син Божий стає Сином Діви,
                  <br />
                  і Гавриїл благодать благовістить.
                  <br />
                  Тому й ми з ним до Богородиці взиваємо:
                  <br />
                  радуйся, благодатна, Господь з Тобою.
                </p>
              </div>
              <div>
                <figure className={styles.videoSide}>
                  <iframe
                    className={styles.videoFrame}
                    src="https://www.youtube.com/embed/Ms3jUd-v4U4   "
                    title="Тропар свята Благовіщення Пресвятої Богородиці"
                    loading="lazy"
                    allowFullScreen
                  />
                  <figcaption className={styles.caption}>
                    Тропар свята Благовіщення Пресвятої Богородиці. Юлія Хмара
                  </figcaption>
                </figure>
              </div>
            </div>
          </div>

          <div className={styles.block}>
            <h2>Радуйся, Маріє! Пісня на Благовіщення Пресвятої Богородиці.</h2>
            {/* <h3>Вокал і вірші: Юлія Хмара</h3> */}

            <div className={styles.flex}>
              <div className={styles.textSide}>
                <p className={styles.textSide}>
                  Благовіщення день світлий
                  <br />
                  Нині Небо співає
                  <br />
                  До Пречистоі Діви
                  <br />
                  Ангел Божий промовляє:
                  <br />
                  <br />
                  Радуйся, Маріє, я перед Тобою.
                  <br />
                  Радуйся, Маріє, Господь з Тобою.
                  <br />
                  Радуйся, Маріє, повна благодати.
                  <br />
                  Радуйся, Маріє, Божая Мати!
                  <br />
                  <br />
                  Вшанувати Матір Божу
                  <br />
                  Ми до храму поспішаєм,
                  <br />
                  Богородице Маріє,
                  <br />
                  Всі до Тебе прибігаєм.
                  <br />
                  Ти моли за нас, Маріє
                  <br />
                  Христа Бога, Твого сина,
                  <br />
                  Щоб збулася наша мрія,
                  <br />
                  Щоб розквітла Україна!
                  <br />
                  <br />
                  Просим перемоги й миру,
                  <br />
                  Просим світла і любові,
                  <br />
                  Хай живе молитва й віра
                  <br />
                  В кожнім серці, в кожнім домі.
                  <br />
                  Молим Тебе, Мати Божа,
                  <br />
                  припадаєм на коліна…
                  <br />
                  Хай добро переможе,
                  <br />
                  Хай воскресне Україна!
                </p>
              </div>
              <div>
                <figure className={styles.videoSide}>
                  <iframe
                    className={styles.videoFrame}
                    src="https://www.youtube.com/embed/gke_Vf_mcc8 "
                    
                    title="Радуйся, Маріє! Пісня на Благовіщення Пресвятої Богородиці."
                    loading="lazy"
                    allowFullScreen
                   
                  />
                  <figcaption className={styles.caption}>
                   Радуйся, Маріє! Пісня на Благовіщення Пресвятої Богородиці.  Юлія Хмара
                  </figcaption>
                </figure>
              </div>
            </div>
          </div>

          <p>
            Благовіщення Пресвятої Богородиці — одне з найшанованіших
            християнських свят, яке за значимістю поступається лише Великoдню та
            Різдву. Цей день – рівно за 9 місяців до свята Різдва Христового, 25
            грудня.
          </p>
        </section>
      </article>
    </div>
  );
}
