import styles from "./page.module.css";

export default function AscensionPage() {
  return (
    <div>
      <article className={styles.article}>
        <section>
          <p className={styles.paragraph}>
            Вознесіння Господнє — одне з дванадцяти свят, присвячених ключовим
            подіям євангельської історії. Це перехідне свято: його дата залежить
            від дати святкування Великодня. Завжди святкується в четвер шостого
            тижня, на сороковий день, після Великодня. Вознесіння належить до
            числа так званих господських свят, тобто тих, що стосуються Господа
            Ісуса Христа.
          </p>
          <p className={styles.paragraph}>
            У цей день ми згадуємо події, що відбулися через сорок днів після
            того, як Ісус Христос був розіп’ятий на Хресті й Воскрес. У день
            Вознесіння Господь зібрав апостолів у Віфанії на горі Єлеон. Христос
            благословив їх і — як був, у плоті — вознісся на небо. Вознесіння
            Господнє описано в Євангелії від Луки, Діяннях святих апостолів і,
            коротко, в закінченні Євангелія від Марка.
          </p>
          <p className={styles.paragraph}></p>

          <p></p>
          <p></p>
        </section>
        <section className={styles.gospel}>
          <h3 className={styles.gospelTitle}>Євангеліє від Луки 24:36–53</h3>

          <p className={styles.paragraph}>
            36 Коли вони про це говорили, Сам Ісус став посеред них і сказав їм:
            мир вам. 37 Вони схвилювались і злякалися, гадаючи, що бачать духа.
            38 Але Він сказав їм: чого хвилюєтесь, чому такі думки входять до
            сердець ваших? 39 Погляньте на руки Мої і на ноги Мої; це Я Сам.
            Доторкніться до Мене і роздивіться; бо дух тіла і кісток не має, як
            бачите у Мене. 40 І, сказавши це, показав їм руки і ноги. 41 Коли ж
            вони від радости ще не вірили і дивувалися, Він сказав їм: чи маєте
            тут якусь їжу? 42 Вони подали Йому частину печеної риби і
            стільниковий мед. 43 І, взявши, їв перед ними. 44 І сказав їм: ось
            ті слова, що Я говорив вам, коли ще був з вами, як належить
            справдитися всьому, написаному про Мене в законі Мойсеєвому і у
            пророків та в псалмах. 45 Тоді розкрив їм розум до розуміння
            Писання. 46 І сказав їм: так написано, і так належало постраждати
            Христу, і воскреснути з мертвих на третій день, 47 і щоб
            проповідувалося в ім’я Його покаяння і відпущення гріхів між усіма
            народами, починаючи від Єрусалима. 48 Ви ж є свідками цього. 49 І
            ось Я посилаю обітницю Отця Мого на вас; ви ж лишайтесь у місті
            Єрусалимі, доки не сповнитеся силою з неба.
          </p>
          <p className={styles.paragraph}>
            50 І вивів їх до Вифанії, і, піднявши руки Свої, благословив їх. 51
            І коли Він благословляв їх, почав віддалятися від них і вознісся на
            небо. 52 Вони, поклонившись Йому, повернулися до Єрусалима з великою
            радістю. 53 І перебували завжди в храмі, прославляючи і
            благословляючи Бога. Амінь.
          </p>
        </section>

        {/* <section>
          <p>
            Благовіщення Пресвятої Богородиці — одне з найшанованіших
            християнських свят, яке за значимістю поступається лише Великoдню та
            Різдву. Цей день – рівно за 9 місяців до свята Різдва Христового, 25
            грудня.
          </p>
        </section> */}
      </article>
    </div>
  );
}
