import styles from "./page.module.css";

export default function PresentationPage() {
  return (
    <article className={styles.article}>
      <section>
        <p>
          Стрітення Господнє відзначають на 40-й день після дня народження Ісуса
          Христа. Назва свята походить від церковнослов’янського слова
          «стрітення» — зустріч , і саме ця зустріч є головним богословським
          змістом події.
        </p>

        <section className={styles.gospel}>
          <h3 className={styles.gospelTitle}>
            Євангеліє від Луки Лк. 2:22–40
          </h3>

          <p>
            22 І коли настали дні очищення за законом Мойсеєвим, то принесли
            Його до Єрусалима, щоб поставити перед Господом, 23 як написано в
            законі Господньому, щоб усяка дитина чоловічої статі, яка розкриває
            утробу, була посвячена Господеві. 24 І щоб принести в жертву, як
            сказано в законі Господньому, дві горлиці або двоє голуб’ят. 25 Був
            тоді в Єрусалимі чоловік на ім’я Симеон. Він був муж праведний та
            благочестивий, що чекав утіхи Ізраїлевої, і Дух Святий був на ньому.
            26 Йому було провіщено Духом Святим, що він не побачить смерти, доки
            не побачить Христа Господнього. 27 І був він приведений Духом у
            храм. І коли батьки принесли Немовля Ісуса, щоб зробити з Ним за
            законним звичаєм, 28 він взяв Його на руки, благословив Бога і
            сказав: 29 нині відпускаєш раба Твого, Владико, за словом Твоїм, з
            миром, 30 бо бачили очі мої спасіння Твоє, 31 яке Ти приготував
            перед лицем усіх народів, 32 світло на просвітлення язичників і
            славу народу Твого Ізраїля. 33 Йосиф же і Мати Його дивувалися
            сказаному про Нього. 34 І благословив їх Симеон і сказав Марії,
            Матері Його: ось лежить Цей на падіння і на піднесення багатьох в
            Ізраїлі і на знак сперечання, — 35 і Тобі Самій душу пройме меч, —
            щоб відкрилися помисли багатьох сердець. 36 Тут була й
            Анна-пророчиця, дочка Фануїлова, з коліна Асирова, яка досягла
            глибокої старости, проживши з чоловіком сім років від дівоцтва
            свого; 37 вдова вісімдесяти чотирьох років, яка не відходила від
            храму, постом і молитвою служачи день і ніч. 38 Прийшовши тієї
            години, вона славила Господа і говорила про Нього всім, хто чекав
            спасіння в Єрусалимі. 39 І коли виконали все за законом Господнім,
            повернулися до Галилеї, до міста свого Назарета. 40 Дитя зростало і
            міцніло духом, сповнюючись премудрости, і благодать Божа була на
            Ньому.
          </p>
        </section>

        <h3>Святитель Іларіон Київський (XI ст.):</h3>

        <blockquote className={styles.quote}>
          У Христі Старий Закон знаходить своє завершення, а благодать Нового
          Завіту входить у світ не силою, а смиренням.
        </blockquote>
        <h3>Святий Григорій Богослов:</h3>

        <blockquote className={styles.quote}>
          Христос «входить у храм не для Себе, а щоб освятити тих, хто в ньому».
        </blockquote>
        <h3>Святитель Іоан Золотоустий:</h3>

        <blockquote className={styles.quote}>
          Симеон тримає на руках Того, Хто «тримає весь світ»
        </blockquote>

        <h3>Святитель Петро Могила:</h3>

        <blockquote className={styles.quote}>
          Христос приходить у храм не як Той, Хто має потребу в очищенні, а як
          Той, Хто очищає і освячує людське життя.
        </blockquote>

        <h3>Святитель Димитрій Ростовський:</h3>

        <blockquote className={styles.quote}>
          Симеон прийняв у свої обійми не лише Немовля, а спасіння світу, бо
          той, хто приймає Христа з вірою, вже не боїться смерті.
        </blockquote>
        <h3>Святитель Феофан Затворник:</h3>

        <blockquote className={styles.quote}>
          Стрітення навчає нас шукати Бога не в надзвичайному, а в послуху і
          простоті серця.
        </blockquote>

        <h3>Блаженніший Митрополит Епіфаній:</h3>

        <blockquote className={styles.quote}>
          Стрітення Господнє нагадує нам, що кожне покоління має свою зустріч із
          Христом — або в храмі, або в серці, або у випробуваннях часу.
        </blockquote>

        <div className={styles.block}>
          <h2>Молитва Симеона Богоприємця</h2>
          <div className={styles.flex}>
            <div className={styles.textSide}>
              <p className={styles.textSide}>
                Нині відпускаєш раба Твого, Владико, за словом Твоїм, з миром,
                <br />
                бо бачили очі мої спасіння Твоє,
                <br />
                яке Ти приготував перед лицем усіх народів,
                <br />
                світло на просвітлення язичників і славу народу Твого Ізраїля.
              </p>
            </div>
            <div>
              <figure className={styles.videoSide}>
                <iframe
                  className={styles.videoFrame}
                  src="https://www.youtube.com/embed/6VAw-iy86II
            "
                  title="Нині відпускаєш.. Пісня Симеона."
                  loading="lazy"
                  allowFullScreen
                />
                <figcaption className={styles.caption}>
                  Нині відпускаєш.. Пісня Симеона. Юлія Хмара і Архієрейський
                  хор Михайлівського Золотоверхого.
                </figcaption>
              </figure>
            </div>
          </div>
        </div>

        <p>
          У православній традиції зі святом Стрітення пов’язане освячення
          свічок, які символізують Христа як Світло світу. Стрітенські свічки
          зберігають у домівках і запалюють під час молитви, у хвилини скорботи
          чи небезпеки.
        </p>

        <p>
          В українській народній традиції Стрітення вважали також днем «зустрічі
          зими з весною», але Церква завжди наголошує, що головне — не природна,
          а духовна зустріч.
        </p>

        <p>
          Стрітення Господнє нагадує нам, що справжня зустріч із Богом
          відбувається в тиші серця, у вірності, терпінні та смиренні. Як
          праведний Симеон, кожен християнин покликаний не лише чекати Христа, а
          впізнати Його і прийняти, дозволивши Божому світлу просвітити своє
          життя.
        </p>
      </section>
    </article>
  );
}
