"use client";

import styles from "./page.module.css";
import Thomas from "./images/Thomas.jpg";
import Image from "next/image";
import { useState } from "react";

export default function ThomasPage() {
  const [expanded, setExpanded] = useState(false);
  return (
    <div className={styles.container}>
      <h1 className={styles.mainHeader}>Господь мій і Бог мій!</h1>
      <article className={styles.article}>
        <figure className={styles.mediaFloat}>
          <div className={styles.imageWrapper}>
            <Image
              src={Thomas}
              alt="Ікона святого апостола Фоми"
              fill
              sizes="(max-width: 768px) 100vw, 40vw"
            />
          </div>
          <figcaption className={styles.caption}>
            Святий апостол Фома. Сучасна православна ікона.
          </figcaption>
        </figure>
        <div className={!expanded ? styles.preview : ""}>
          {/* <h3 className={styles.historyHeader}>Історія</h3> */}

          <p className={styles.paragraph}>
            Святий апостол Фома був одним із дванадцяти найближчих учнів Господа
            нашого Ісуса Христа. За переданням, він походив із Галілеї та,
            подібно до багатьох апостолів, був простим трудівником. Почувши
            благовістя Ісуса Христа, він все залишив і пішов за Ним.
          </p>
          <p className={styles.paragraph}>
            За характером своїм він любив дива і вважав їх найпереконливішим
            доводом могутності віри. Але він також відрізнявся схильністю до
            сумнівів і розсудливого аналізу. В ньому була якась дитячість,
            простота, щирість і простодушність.
          </p>
          <p className={styles.paragraph}>
            Одного разу після Воскресіння Господнього, коли інші апостоли
            сповістили Фомі про явлення воскреслого Христа, він не повірив їхнім
            словам і сказав, що повірить лише тоді, коли сам побачить рани
            Спасителя та доторкнеться до них. Через вісім днів Господь явився
            апостолам і звернувся до Фоми зі словами: «дай палець твій сюди і
            подивись на руки Мої; подай руку твою і вклади в ребра Мої, і не
            будь невірним, але вірним.». Тоді апостол виголосив одне з
            найглибших свідчень віри в Євангелії:{" "}
            <span className={styles.quoteToHeader}>
              «Господь мій і Бог мій!»
            </span>{" "}
            (Ін. 20:28). Так його сумнів став дорогою до ще міцнішої та
            усвідомленішої віри.
          </p>
          <p className={styles.paragraph}>
            Апостол Фома проповідував у Парфії, Мідії та Індії. Перекази
            зберегли розповідь про те, за яких обставин пішов св. Фома на справу
            Євангелія в Індію. Тамтешній цар побажав збудувати собі палац. Фома
            назвався архітектором і відправився на поклик царя. Після прибуття
            він почав ревно проповідувати віру Христову, багатьох охрестив, а
            золото, отримане на будівництво, роздавав нужденним. Він знав, що
            Бог допоможе йому навернути до істини царя, пам’ятав учення Христа
            про скарб на небі (Мф. 6:19–20).
          </p>
          <p className={styles.paragraph}>
            І справді, все більше поширювалося слово Боже, але були й
            незадоволені. Вони і донесли цареві, що Фома, котрий назвався
            архітектором, і не починав споруджувати розкішного палацу, а
            проповідує «нового Бога», творить чудеса і роздає царське золото
            жебракам. Розгнівався цар і велів ув’язнити апостола. Тим часом
            улюблений брат царя сильно занедужав. Під час хвороби піднеслася
            душа в небесні оселі й, волею Господа, у видінні йому було показано
            хороми, приготовані для святих, і запропоновано вибрати одні з них.
            Коли ж він вибрав найкращі, то ангел Божий сказав йому: «Це житло ти
            не можеш зайняти, тому що Фома спорудив його на золото брата твого,
            і воно належить твоєму братові-царю».
          </p>
          <p className={styles.paragraph}>
            Прийшовши до тями, хворий розповів про побачене. Зрозумів тоді цар
            сенс цього видіння, поспішив звільнити святого і просвітився від
            апостола світлом християнського вчення.
          </p>
          <p className={styles.paragraph}>
            Завершив свій земний шлях апостол Фома мученицькою смертю в Індії
            близько 72 року. За переданням, він був убитий списами за проповідь
            християнської віри.
          </p>

          <p className={styles.paragraph}>
            Один християнин таємно взяв чесні мощі св. Фоми і відніс їх до
            Месопотамії, до міста Едесси. Там була побудована в ім’я його чудова
            церква, і віруючі з віддалених країн сходились туди й отримували
            зцілення. Частини мощей апостола є в Індії, Угорщині та на Афоні.
          </p>
          <p className={styles.paragraph}>
            Церква вшановує його як славного і всехвального апостола, а його
            життя нагадує, що щире прагнення до істини та зустріч із Христом
            здатні перетворити сумнів на непохитну віру. Саме тому апостол Фома
            є прикладом для всіх, хто шукає Бога не лише серцем, але й свідомим
            переконанням.
          </p>

          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}></p>
        </div>
        <button
          className={styles.readMore}
          onClick={() => setExpanded(!expanded)}
        >
          {expanded ? "Згорнути..." : "Читати далі..."}
        </button>
      </article>
      <article className={styles.article}>
        {" "}
        <blockquote className={styles.gospel}>
          <h3 className={styles.gospelTitle}>Євангеліє від Іоана 14:4-5</h3>4 А
          куди Я йду, ви знаєте, і путь знаєте. 5 Фома сказав Йому: Господи! Не
          знаємо, куди йдеш; і як можемо знати путь? 6 Ісус сказав йому: Я є
          путь, і істина, і життя; ніхто не приходить до Отця, як тільки через
          Мене.
        </blockquote>
        <blockquote className={styles.gospel}>
          <h3 className={styles.gospelTitle}>Євангеліє від Іоана 20:19–29</h3>19
          Того ж першого дня після суботи, ввечері, коли двері дому, де
          зібралися ученики Його, були замкнені з остраху перед юдеями, прийшов
          Ісус і став посередині, і каже їм: мир вам! 20 Сказавши це, Він
          показав їм руки, і ноги, і ребра Свої. Ученики зраділи, побачивши
          Господа. 21 Ісус же сказав їм вдруге: мир вам! Як послав Мене Отець,
          так і Я посилаю вас. 22 Сказавши це, Він дихнув і говорить їм:
          прийміть Духа Святого. 23 Кому відпустите гріхи, тим відпустяться, на
          кому залишите, залишаться. 24 Фома ж, один з дванадцятьох, який звався
          Близнюком, не був тут з ними, коли приходив Ісус. 25 Інші ученики
          сказали йому: ми бачили Господа. Він же сказав їм: якщо не побачу на
          руках Його рани від цвяхів і не вкладу пальця мого в рани від цвяхів,
          і не вкладу руки моєї в ребра Його, не повірю. 26 Через вісім днів
          ученики Його знову були в домі, й Фома з ними. Прийшов Ісус, коли
          двері були замкнені, став посеред них і сказав: мир вам! 27 Потім
          говорить Фомі: дай палець твій сюди і подивись на руки Мої; подай руку
          твою і вклади в ребра Мої, і не будь невірним, але вірним. 28 Фома у
          відповідь сказав Йому: Господь мій і Бог мій! 29 Ісус говорить йому:
          ти повірив, тому що побачив Мене; блаженні ті, що не бачили й
          увірували.
        </blockquote>
        <blockquote className={styles.quote}>
          «Фома, що був колись слабший за інших апостолів у вірі, став по
          благодаті Божій мужнішим, ревнішим і невтомнішим за всіх їх.»
          <br />— святитель Іоан Золотоустий
        </blockquote>
        <blockquote className={styles.quote}>
          «Невірство Фоми принесло нам більше користі для віри, ніж віра інших
          учнів.»
          <br />— святитель Григорій Великий
        </blockquote>
        <blockquote className={styles.quote}>
          «Фома бачив і торкався людини, але визнав Бога, Якого не бачив.»
          <br />— блаженний Августин
        </blockquote>
        <blockquote className={styles.quote}>
          «Фома доторкнувся до людської плоті Спасителя і сповідав Його істинним
          Богом, показавши єдність двох природ у Христі.»
          <br />— святитель Григорій Палама
        </blockquote>
        <blockquote className={styles.quote}>
          «Фома шукав не приводу для невірства, а певності для віри; тому
          Господь не відкинув його, але привів до досконалого сповідання.»
          <br />— святитель Феофілакт Болгарський
        </blockquote>
        <blockquote className={styles.quote}>
          «Через сумнів Фоми Господь відкрив людям істину Свого Воскресіння, щоб
          ніхто не вважав його привидом чи видінням.»
          <br />— преподобний Єфрем Сирін
        </blockquote>
      </article>
      <article className={styles.article}></article>
      <article className={styles.article}></article>
    </div>
  );
}
