import styles from "./page.module.css";


export default function ThomasPage() {
  return (
    <div className={styles.container}>
      <h1 className={styles.mainHeader}>Господь мій і Бог мій!</h1>
      {/* <p> І не будь ти невіруючий, але віруючий!</p> */}
      {/* <p>Через вісім днів ученики Його знову були в домі, й Фома з ними. Прийшов Ісус, коли двері були замкнені, став посеред них і сказав: мир вам! 27 Потім говорить Фомі: дай палець твій сюди і подивись на руки Мої; подай руку твою і вклади в ребра Мої, і не будь невірним, але вірним. 28 Фома у відповідь сказав Йому: Господь мій і Бог мій! 29 Ісус говорить йому: ти повірив, тому що побачив Мене; блаженні ті, що не бачили й увірували.</p> */}
    </div>
  );
}