import styles from "./page.module.css";

export default function AidPage() {
  return (
    <main className={`${styles.addContainer} container`}>
      <section>
        <h1 className={`${styles.advertHeader} sr-only`}>Оголошення</h1>
        <p className={styles.advertisement}>
          Христос Воскрес! Дорога громадо, нашим воїнам на лінії фронту потрібна
          допомога, а саме: матеріали для облаштування бліндажів, агросітка
          зелена(якою накривають теплиці) а також гідроізоляційна плівка чорного
          кольору. Хто має бажання і можливість відгукніться. Нехай Господь
          благословить!
        </p>
        <p className={styles.advertisement}>
          Дорогі браття і сестри, наші захисники мають гостру потребу в засобах
          гігієни (вологі серветки, сухий душ та ін.), прошу долучіться до
          доброї справи, приносьте до церкви. Щиро дякую за вашу допомогу.
        </p>
        {/* <p className={styles.advertisement}>
          Дорогі браття і сестри, збираємо побутові газові балони б/у для
          виготовлення обігрівачів на дровах (буржуйок). Для наших захисників.
        </p> */}
        <p className={styles.advertisement}>
          Не забуваймо про наших мужніх воїнів, які віддають за нас своє життя.
          Зараз є гостра необхідність у речах: ковдри, подушки, простині,
          підодіяльники, шкарпетки, спідня білизна — усе чисте. Пункт збору ви
          знаєте. Нехай Господь благословить!
        </p>
      </section>
    </main>
  );
}
