import styles from "./page.module.css";

export default function AidPage() {
  return (
    <main className={`${styles.addContainer} container`}>
      <section>
        <h1 className={`${styles.advertHeader} sr-only`}>Оголошення</h1>
        <div className={styles.advertisement}>
          Дорога громадо!
          <br /> Семінар-практикум з писання Великодньої писанки <br />
          <p className={styles.data}>
            2 - 4 квітня <br /> 
            <span className={styles.time}> з 9:00 до 19:00</span>
          </p>
          Відкриття 2 квітня о 9:00 <br />
          Майстер-класи проводять відомі вінницькі писанкарки. <br /> Чекаємо на
          вас!
        </div>
        <p className={styles.advertisement}>
          Слава Ісусу Христу! Дорога громадо, наші захисники мають гостру
          потребу в засобах гігієни (вологі серветки, сухий душ та ін.), прошу
          долучіться до доброї справи, приносьте до церкви. Щиро дякую за вашу
          допомогу.
        </p>
        <p className={styles.advertisement}>
          Дорогі браття і сестри, збираємо побутові газові балони б/у для
          виготовлення обігрівачів на дровах (буржуйок). Для наших захисників.
        </p>
        <p className={styles.advertisement}>
          Не забуваймо про наших мужніх воїнів, які віддають за нас своє життя.
          Зараз є гостра необхідність у речах: ковдри, подушки, простині,
          підодіяльники, шкарпетки, спідня білизна — усе чисте. Пункт збору ви
          знаєте. Нехай Господь благословить!
        </p>
      </section>
    </main>
  );
}
