import styles from "./page.module.css";

export default function AidPage() {
  return (
    <div className= {`${styles.addContainer} container`}>
      
           
        <p className={styles.advertisement}>
          Слава Ісусу Христу! Дорога громадо, наші захисники мають гостру
          потребу в засобах гігієни (вологі серветки, сухий душ та ін.), прошу
          долучіться до доброї справи, приносьте до церкви. Щиро дякую за вашу
          допомогу.
        </p>
        <p className={styles.advertisement}>
          Дорогі браття і сестри, збираємо побутові газові балони б/у для
          виготовлення обігрівачів на дровах (буржуйок). Для наших захисників.
        </p>
        <p className={styles.advertisement}>
          Не забуваймо про наших мужніх воїнів, які віддають за нас своє життя.
          Зараз є гостра необхідність у речах: ковдри, подушки, простині,
          підодіяльники, шкарпетки, спідня білизна — усе чисте. Пункт збору ви
          знаєте. Нехай Господь благословить!
        </p>
        <p className={styles.advertisement}>
          Потрібен оператор твердопаливного котла (кочегар). Житлом і
          харчуванням забезпечуємо. Подробиці за тел: (097) 409-99-13
        </p>
    </div>
  );
}