"use client";

import { useState } from "react";
import Image from "next/image";
import styles from "./page.module.css";
import GregorPalamas from "./images/GregorPalamas.jpg";

export default function HryhoriiPalama() {
  const [expanded, setExpanded] = useState(false);

  return (
    <div className={styles.container}>
      <article className={styles.article}>
        <figure className={styles.mediaFloat}>
          <div className={styles.imageWrapper}>
            <Image
              src={GregorPalamas}
              alt="Cвятий Григорій Палама"
              fill
              sizes="(max-width: 768px) 100vw, 40vw"
            />
          </div>
          <figcaption className={styles.caption}>
            Григорій Палама. Фреска з афонського монастиря Ватопед, 14 ст.
          </figcaption>
        </figure>
        <div className={!expanded ? styles.preview : ""}>
          <h3 className={styles.historyHeader}>Історія</h3>{" "}
          <p className={styles.paragraph}>
            Григо́рій Палама́  — релігійний діяч,
            подвижник, богослов-містик, полеміст, поборник ісихазму, один із
            найвищих авторитетів у православному християнстві (Отець церкви),
            святий.
          </p>
          <p className={styles.paragraph}>
            Народився святий у 1296 р. в знатній константинопольській сім’ї вихідців з Малої Азії, які в часи турецької навали знайшли політичний притулок у Візантії. Його батько  служив при дворі візантійського імператора Андроніка ІІ Палеолога, був його довіреною особою. Після смерті батька  імператор узяв Григорія під свою опіку, надав йому можливість навчатися разом зі своїм онуком . 
          </p>
          <p className={styles.paragraph}>
            Святителю Григорію, зважаючи на всі його позитивні якості,
            пропонували різні високі посади при імператорському дворі. Але він не бажав слави світу цього і, відхиливши всі пропозиції, в
            двадцятилітньому віці оселився на святій горі Афон. Для набуття духовного досвіду просвітлення Палама долучився до громади ченців-аскетів, які практикували особливу молитовну практику («розумне діяння»).  Треба сказати, що серед ченців Святої гори в XIV ст. був розповсюджений особливий рух – ісіхазм.
          </p>
          <p className={styles.paragraph}>
            Ісіхазм – від грецького слова «ісіхія» – безмовність, тиша.
            Послідовники цього руху вели особливий спосіб життя. Вони зводили
            свій розум до умоспоглядання. Через творення особливого молитовного правила, наприклад, – творення безперестанної Ісусової молитви, з’єднувалися з Богом. Молитва допомагала їм очистити розум та серце і це виражалось у баченні Божественного світла, саме такого світла, яке бачили апостоли на Фаворській горі, будучи очевидцями Преображення Господнього, про що апостол Петро говорить у своєму Другому Соборному посланні: «Бо ми сповістили вам силу і пришестя Господа нашого Ісуса Христа, не йдучи за хитромудрими байками, а бувши очевидцями Його величі»(2 Петр. 1. 16).
          </p>
          <p className={styles.paragraph}>
            Святителя Григорія Паламу через захист вчення про Благодатне світло
            почали називати «сином Божественного Світла».
          </p>
          <p className={styles.paragraph}>
            Святитель навчав на основі досвіду святих, що благодать Всесвятого
            Духа не є щось тварне. Ми здатні стати не тільки духовними, але й
            богоносними. Свт. Григорій Палама своїм глибоким богослів’ям,
            почерпнутим з багатовікового досвіду Церкви, а також на своєму
            власному досвіді подвижника-ісіхаста, привідкриває нам таїну єднання
            людини з Богом, а це і є головна мета не тільки Великого посту, але
            й всього життя людини. Свт. Іриней Ліонський навчає: «Слава Божа,
            сяйво Боже, Боже торжество – це людина, яка виросла до повної міри
            своєї величі».
          </p>
          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}></p>
          <p className={styles.paragraph}>Похований у кафедральному соборі Святої Софії. Після захоплення міста турками і перетворення храму на мечеть, мощі свт. Григорія Палами були спершу перенесені до монастиря Влатадон, а потім — у митрополичий собор міста. З 1890 зберігаються в новому кафедральному соборі — Святого Григорія Палами в Салоніках (освячений на честь святого 1914). </p>
        </div>
        <button
          className={styles.readMore}
          onClick={() => setExpanded(!expanded)}
        >
          {expanded ? "Згорнути..." : "Читати далі..."}
        </button>
      </article>
    </div>
  );
}
