import styles from "./page.module.css";

export default function sacramentsPage() {
  return (
    <div style={{ padding: "2rem", textAlign: "center" }}>
      <h1>Таїнства</h1>
      <p className={styles.sacramentsParagraph}>
        Таїнства Церкви - це священнодії, в яких під обрядами невидимо діє
        благодать Божа, тобто спасительна дія Святого Духа.
      </p>
      <p className={styles.sacramentsParagraph}>
        Таїнство – це немовби канал між Божественним та нашим світом, по якому
        до нас сходить благодать Божа. В кожному Таїнстві поєднується духовне і
        матеріальне – саме через матеріальні предмети благодать Божа входить до
        нашого світу. Причина цього – в двосоставності людської природи, яка
        складається з душі і тіла, обидва з яких мають бути освяченими Божою
        благодаттю. Саме в Церковних Таїнствах досягається та велика ціль життя
        віруючої людини, про яку говорив наш великий святий Серафим Саровський:
        стяжання Духа Святого.{" "}
      </p>
      <p className={styles.sacramentsParagraph}>
        У Православній Церкві сім Таїнств: перше - це Таїнство Хрещення - яке є
        духовним народженням; друге - це Таїнство Миропомазання - під час якого
        людина отримує дари Святого Духа для життя духовного; третє - це
        Причастя - під час якого християнин під виглядом хліба і вина вкушає
        Істинні Тіло і Кров Господа нашого Ісуса Христа, таким чином, єднаючись
        з ним; четверте - Покаяння - Таїнство примирення з Богом та відновлення
        благодаті Хрещення; п&apos;яте - Священство - Таїнство, у якому обраний
        від народу через покладання рук єпископа отримує благодать звершувати
        Таїнства та богослужіння, а також духовно опікувати народ Божий; шосте -
        це Таїнство Шлюбу - в якому надається благословення Господнє на подружнє
        життя, народження та виховання дітей; і сьоме - це Таїнство
        Єлеєосвячення (або Соборування) - в якому по молитвам Церкви людина
        отримує зцілення від хвороб духовних і тілесних.
      </p>
      <p className={styles.sacramentsParagraph}>
        Участь у Таїнствах - це участь у справжньому благодатному житті Церкви.
      </p>
    </div>
  );
}
