import styles from "./page.module.css";

export default function sacramentsPage() {
  return (
    <div className={`${styles.container} container`}>
      <h1 className={styles.sacramentsHeader}>Таїнства</h1>
      <p className={styles.sacramentsParagraph}>
        Таїнства Церкви - це священнодії, в яких під обрядами невидимо діє
        благодать Божа, тобто спасительна дія Святого Духа.
      </p>
      <p className={styles.sacramentsParagraph}>
        Таїнство – це немовби канал між Божественним та нашим світом, по якому
        до нас сходить благодать Божа. В кожному Таїнстві поєднується духовне і
        матеріальне – саме через матеріальні предмети благодать Божа входить до
        нашого світу. Причина цього – в двосоставності людської природи, яка
        складається з душі і тіла, обидва з яких мають бути освяченими Божою
        благодаттю. Саме в Церковних Таїнствах досягається та велика ціль життя
        віруючої людини, про яку говорив наш великий святий Серафим Саровський:
        стяжання Духа Святого.
      </p>
      <p className={styles.sacramentsParagraph}></p>

      <h2 className={styles.sacramentsHeader}>
        У Православній Церкві сім Таїнств:
      </h2>
      <ul className={styles.sacramentsList}>
        <li>
          <strong>Таїнство Хрещення</strong> - яке є духовним народженням;
        </li>
        <li>
          <strong>Таїнство Миропомазання</strong> - під час якого людина отримує дари
          Святого Духа для життя духовного;
        </li>
        <li>
          <strong>Таїнство Причастя</strong> - під час якого християнин під виглядом
          хліба і вина вкушає Істинні Тіло і Кров Господа нашого Ісуса Христа,
          таким чином, єднаючись з ним;
        </li>
        <li>
          <strong>Таїнство Покаяння</strong> - примирення з Богом та відновлення
          благодаті Хрещення;
        </li>
        <li>
          <strong>Таїнство Священства</strong> -  у якому обраний від народу
          через покладання рук єпископа отримує благодать звершувати Таїнства та
          богослужіння, а також духовно опікувати народ Божий;
        </li>
        <li>
          <strong>Таїнство Шлюбу</strong> - у якому надається благословення
          Господнє на подружнє життя, народження та виховання дітей;
        </li>
        <li>
          <strong>Таїнство Єлеєосвячення (або Соборування)</strong> - у якому по
          молитвам Церкви людина отримує зцілення від хвороб духовних і
          тілесних.
        </li>
      </ul>
      <p className={styles.sacramentsParagraph}>
        Участь у Таїнствах - це участь у справжньому благодатному житті Церкви.
      </p>
    </div>
  );
}
