"use client";

import { useState } from "react";
import Image from "next/image";
import styles from "./page.module.css";
import TheodoreTyro from "./images/TheodoreTyro.jpg";

export default function TheodoreTyron() {
  const [expanded, setExpanded] = useState(false);

  return (
    <div className={styles.container}>
               <h1 className={styles.mainHeader}>Я християнин, я вклоняюся лише Христові.</h1>
      <article className={styles.article}>
        <figure className={styles.mediaFloat}>
          <div className={styles.imageWrapper}>
            <Image
              src={TheodoreTyro}
              alt="Святий Феодор Тирон"
              fill
              sizes="(max-width: 768px) 100vw, 40vw"
            />
          </div>
          <figcaption className={styles.caption}>Св. Феодор Тирон.</figcaption>
        </figure> 

        <div className={!expanded ? styles.preview : ""}>
          <h2 className={styles.historyHeader}>Життєпис</h2>

          <p className={styles.paragraph}>
            Святий Мученик Феодор Тирон був воїном в м. Аласії в Понтійській
            області Римської імперії. Прізвище Тирон вказує на те, що він був
            новобранцем.
          </p>

          <p className={styles.paragraph}>
            Під час гоніння імператора Максиміана (286–305) воїна Теодора
            звинуватили в підпалі язичницького храму богині Кібели та разом із
            іншими християнами змушували зректись віри в Христа й принести
            жертву ідолам. Тоді він сказав: «<span className={styles.quoteToHeader}>Я християнин, я вклоняюся лише Христові.</span> Він Цар, Якому я служу, і тільки Йому я принесу жертву!» На суді він мужньо заявив, що Ісус Христос є
            правдивим Богом.
          </p>

          <p className={styles.paragraph}>
            Воїна Теодора привели до градоначальника Публія, де було вирішено
            кинути його в темницю, щоб він там помер голодною смертю. Через
            якийсь час Теодора Тирона знайшли живим та здоровим. Градоначальник
            знову запропонував Теодору принести жертву ідолам, та він
            відмовився. Його було віддано на тяжкі тортури — тіло стругали
            залізними зубцями, та Святий продовжував сповідувати свою віру в
            Христа.
          </p>

          <p className={styles.paragraph}>
            В цей час, як говорить Святе Передання, йому з&apos;явився Христос
            та, втішаючи, підкріпив його сили. Через певний час Теодора Тирона
            ще раз привели до правителя міста й останній раз просили зректися
            віри в Христа та принести жертву язичницьким богам, проте воїн
            Теодор безстрашно сповідував віру у воскреслого Господа. За це
            Мученика піддали ще більшим тортурам та засудили на спалення.
            Великомученик Теодор мужньо зайшов у вогонь і з молитвою віддав свою
            душу Богу близько 306 року.
          </p>

          <p className={styles.paragraph}>
            Непошкоджене вогнем тіло Великомученика благочестива християнка
            Євсевія заховала в себе вдома у місті Євхаїті. Пізніше мощі Святого
            були перенесені в Константинополь, а голова Великомученика спочатку
            була у Бринзії, а зараз у Гаеті (сучасна Італія).
          </p>
          <p className={styles.paragraph}>
            Через 50 років після мученицької смерті Теодора Тирона імператор
            Юліан Відступник (361–363), бажаючи осквернити християнам Святий
            Великий піст, наказав градоначальнику Константинополя кожен день
            протягом першої седмиці Великого посту кропити продукти, що
            продаються на ринку, кров&apos;ю ідольських жертв. У цей же час
            Великомученик Теодор з&apos;явився у сні Константинопольському
            архієпископу Євдоксію та звелів йому попередити християн в цей
            період не купувати ніяких продуктів, а вживати коливо (кутю), тобто
            варену пшеницю з медом.{" "}
          </p>
          <p className={styles.paragraph}>
            В пам&apos;ять про цю подію Православна церква особливо вшановує
            Великомученика Теодора Тирона в першу суботу Великого посту.
            Напередодні цього дня, в п&apos;ятницю, після заамвонної молитви
            читається Канон Великомученику Теодору та благословляється
            коливо.{" "}
          </p>
          <p className={styles.paragraph}>
            Коли Теодор вийшов на волю, то підпалив поганську божницю, що стояла
            посеред міста. За це його вдруге ув&apos;язнили і наказали
            немилосердно бичувати, а потім кинути на спалення живцем у піч.
            Загинув Теодор мученицькою смертю 306 року в понтійському місті
            Амасії у Малій Азії.{" "}
          </p>
        </div>

        <button
          className={styles.readMore}
          onClick={() => setExpanded(!expanded)}
        >
          {expanded ? "Згорнути..." : "Читати далі..."}
        </button>
      </article>
      
      <article className={styles.prayerArticle}>
        <h2 className={styles.prayerHeader}>
          Молитва до Святого Феодора Тирона: <br /> захист та справедливий мир у часи
          війни
        </h2>
        <p className={styles.paragraph}>
          Отче святий великомученику Феодоре Тироне, великий заступнику перед
          Престолом Божим! Прийми нашу молитву і зверни свій благословенний
          погляд на наші немічні серця. Наповни нас силою та вірою, які тобі
          були властиві під час твого святого подвигу.
        </p>
        <p className={styles.paragraph}>
          Молимося тобі, о великий заступнику, захищай нас від всіляких небезпек
          і зловісних сил. Вгамуй бурю наших сумнівів, освітли темряву наших душ
          і направляй нас шляхом праведності та любові.
        </p>
        <p className={styles.paragraph}>
          Сповни нас мужністю і терпінням у життєвих випробуваннях, даруй нам
          мудрість у виборі праведного шляху. Будь нашим заступником у війні зі
          злом, і нехай твоя свята молитва сприяє нашому духовному зростанню.
        </p>
        <p className={styles.paragraph}>
          О, святий великомученику Феодоре Тироне, прийми нас під свій захисний
          покров в цей час російсько-української війни звертаємось до Тебе з
          молитвою за мир та захист. Просимо Тебе, умилосердися над тими, хто
          переживає страх та страждання.
        </p>
        <p className={styles.paragraph}>
          Благослови наших захисників і воїнів, надай їм силу та мужність в цей
          важкий час протистояння. Нехай Твоя рука Великомучениче Феодоре Тироне
          захищає невинних і принесе заспокоєння тим, хто потерпає від війни.
        </p>
        <p className={styles.paragraph}>
          Святий мучениче Феодоре Тироне, надішли справедливий мир і примирення
          в серця людей. Нехай Твоя благодать призведе до завершення бойових дій
          і принесе світло надії у темряві війни. Амінь.
        </p>
      </article>
    </div>
  );
}
