import Image from "next/image";
import css from "./page.module.css";
import SerafimSarovskiy from "./images/serafim-sarovskiy-vinnytsya.jpg";
import BasilImgIcon from "./images/images.webp";

export default function VasylVelykyi() {
  return (
    <article className={css.article}>
      {/* <h1 className={css.title}>
        Преподобний Серафим Саровський — святий радості та миру
      </h1> */}
      <h1 className={css.mainHeader}>Радість моя, Христос воскрес!</h1>

      <figure className={css.mediaFloat}>
        <Image
          src={SerafimSarovskiy}
          alt="Серафим Саровський"
          width={560}
          height={880}
        />
        <figcaption className={css.caption}>
          Преподобний Серафим Саровський. Ікона храму прп. Серафима Саровського,
          Вінниця.
        </figcaption>
      </figure>

      <p>
        Преподобний Серафим Саровський (1754–1833) — один із найулюбленіших і
        найвідоміших православних святих. Його життя стало яскравим прикладом
        глибокого смирення, безперервної молитви та живої любові до кожної
        людини. Святого Серафима називають подвижником миру й радості, адже саме
        ці духовні плоди він прагнув передати всім, хто звертався до нього.
      </p>

      <p>
        Майбутній святий народився в місті Курську в побожній родині купця. При
        хрещенні отримав ім’я Прохор. Ще з дитинства його життя було позначене
        особливою Божою опікою: він дивом зцілився після тяжкої хвороби, а
        згодом пережив кілька чудесних спасінь. Ці події зміцнили в ньому
        прагнення присвятити себе служінню Богові.
      </p>

      <p>
        У молодому віці Прохор вступив до Саровської пустині, де прийняв
        чернецтво з ім’ям Серафим, що означає «палаючий» або «вогненний».
        Протягом багатьох років він вів суворе аскетичне життя: перебував у
        самітництві, дотримувався строгого посту, багато молився та читав Святе
        Письмо. Одним із найвідоміших подвигів святого стало тисячоденне стояння
        на камені в молитві, коли він день і ніч звертався до Бога з проханням
        про милість для світу.
      </p>

      <p>
        Особливим випробуванням для преподобного став напад розбійників, які
        жорстоко побили його. Хоча він залишився з тілесними ушкодженнями на все
        життя, Серафим не тільки не озлобився, а й простив своїх кривдників,
        відмовившись свідчити проти них. Цей вчинок став яскравим свідченням
        євангельської любові та прощення.
      </p>
      <p>
        Наприкінці життя преподобний Серафим відкрив двері своєї келії для
        людей. До нього приходили тисячі паломників — прості селяни, монахи,
        духовенство та знать. Кожного він зустрічав словами:<span className={css.quoteToHeader}> «Радість моя, Христос воскрес!»</span>,
        нагадуючи, що істинна християнська радість народжується з миру серця і
        єднання з Богом. Святому була дарована благодать прозорливості та
        зцілення, і багато людей отримували допомогу за його молитвами.
      </p>
      <figure className={css.mediaFloat}>
        <Image
          src={BasilImgIcon}
          alt="Ікона XVIII сторіччя"
          width={560}
          height={880}
        />
        <figcaption className={css.caption}>
          Преподобний Серафим Саровський годує ведмедя
        </figcaption>
      </figure>

      <h3>Він казав:</h3>

      <p className={css.quote}>«Суди себе сам, і Господь не осудить»</p>

      <p className={css.quote}>«Рай і пекло починаються на землі»</p>

      <p className={css.quote}>
        «Знайди мир у своїй душі, і навколо тебе врятуються тисячі».
      </p>

      <p className={css.quote}>«На хліб та воду ще ніхто не скаржився».</p>

      <p className={css.quote}>
        «Немає гірше гріха, і немає нічого жахливішого і гіршого духу зневіри».
      </p>
      <p className={css.quote}>
        «Істинна віра не може бути без справ: хто істинно вірує, той неодмінно
        має і справи».
      </p>

      <p className={css.quote}>
        «Якщо зруйнується сім&apos;я, то повалені будуть держави і перекрутяться
        народи».
      </p>

      <article className={css.nestedArticle}>
        <h2>Коротке молитовне правило прп. Серафима Саровського</h2>

        <h3>Ранкове правило (вранці та перед сном):</h3>
        <ul>
          <li>«Отче наш» (тричі).</li>
          <li>«Богородице Діво, радуйся» (тричі).</li>
          <li>«Символ віри» (один раз). </li>
        </ul>
        <h3>Протягом дня (під час роботи, ходьби):</h3>
        <p>
          Тихо читати: «Пресвята Богородице, спаси мя грішного» або «Господи
          Ісусе Христе, Богородицею помилуй мя грішного».
        </p>
        <h3>Для тих, кому важко:</h3>
        <p>
          Якщо немає часу на повне правило, можна читати ці молитви в будь-який
          час і в будь-якому положенні, пам`ятаючи, що «всякий, хто призове ім`я
          Господнє, спасеться».
        </p>
      </article>

      <figure className={css.videoFloat}>
        <iframe
          src="https://www.youtube.com/embed/uf6FzApz7UQ"
          title="Молитва до Св. прп. Серафима Саровського"
          allowFullScreen
        />
        <figcaption className={css.caption}>
          Молитва до Св. прп. Серафима Саровського
        </figcaption>
      </figure>

      <p>
        Святий Серафим особливо наголошував на значенні Святого Духа в житті
        людини. Його вчення про «стяжання Духа Святого» стало духовним
        орієнтиром для багатьох поколінь християн.
      </p>
      <p>
        Пам’ять преподобного Серафима Саровського Церква вшановує 2 січня. Його
        життя й слова й сьогодні надихають людей шукати миру серця, живої
        молитви та справжньої радості у Христі.
      </p>
    </article>
  );
}
