import styles from "./page.module.css";

export default function PaschaPage() {
  return (
    <div>
      <article className={styles.article}>
        <section>
          <p className={styles.paragraph}>
            Великдень – найбільше православне свято, яке знаменує тріумф віри,
            перемогу над гріхом та смертю, початок нового життя, головне свято
            богослужебного року, встановлене на честь Воскресіння Господа нашого
            Ісуса Христа.
          </p>
          <p className={styles.paragraph}>«Христос Воскрес із мертвих, смертю смерть подолав, і тим, що в гробах, життя дарував».</p>
          <p className={styles.paragraph}></p>
          <p></p>
          <p></p>
        </section>
      </article>
      <article className={styles.article}>
        {" "}
        <blockquote className={styles.gospel}>
          <h3 className={styles.gospelTitle}>Євангеліє від Іоана 1:1-18</h3>
          Споконвіку було Слово, і Слово було у Бога, і Слово було Бог. 2 Воно
          було споконвіку в Бога. 3 Все через Нього сталось, і без Нього ніщо не
          сталося, що сталося. 4 У Ньому було життя, і життя було світлом людям.
          5 І світло в темряві світить, і темрява не огорнула його. 6 Був
          чоловік, посланий від Бога; ім’я йому Іоан. 7 Він прийшов для
          свідчення, щоб свідчити про Світло, щоб усі увірували через нього. 8
          Він не був світлом, але був посланий, щоб свідчити про Світло. 9 Було
          Світло істинне, що освітлює кожну людину, яка приходить у світ. 10 У
          світі був, і світ через Нього постав, і світ Його не пізнав. 11 До
          своїх прийшов, і свої Його не прийняли. 12 А тим, які прийняли Його,
          що вірують в ім’я Його, дав силу дітьми Божими бути, 13 які не від
          крови, не від похоті плотської, не від хотіння чоловічого, а від Бога
          народилися. 14 І Слово стало плоттю, і вселилося між нами, повне
          благодаті й істини; і ми бачили славу Його, славу, як Єдинородного від
          Отця. 15 Іоан свідчить про Нього і голосно каже: це Той, про Кого я
          говорив; Той, Хто йде за мною, став попереду мене, бо раніше від мене
          був. 16 І від повноти Його ми всі прийняли і благодать на благодать,
          17 бо закон був даний через Мойсея; а благодать і істина через Ісуса
          Христа сталися. 18 Бога ніхто не бачив ніколи; Єдинородний Син, Який у
          лоні Отця, Він явив.
        </blockquote>
      </article>
    </div>
  );
}
