[
  {
    "id": 1,
    "title": " Патріарша Божественна літургія у неділю 1-шу після П’ятидесятниці, всіх святих. 15.06.2025р. ",
    "youtubeId": "6oCY7JBsFf8",
    "description": "У Неділю 1-шу після Пятдесятниці, Свята Церква закликає нас до особливого шанування Всіх святих. Може виникнути запитання: навіщо окремий день для вшанування всіх святих, якщо кожному з них уже присвячено свій день у церковному календарі?Господь наш Ісус Христос, прийшовши на землю, очистивши своєю Хресною смертю нашу плоть від первородного гріха кожного з нас покликав до святості. Може зʼявитися питання, ніби церква визначає, хто святий, а хто ні. Але насправді, визначає хто достойний бути причасником Божої оселі обирає тільки Господь.Ще в ранній церкві, після того як апостольська звістка про прихід Спасителя почала поширюватися, саме тоді, під час гонінь на церкву, християни починають вшановувати своїх попередників. Бачачи мученицьку смерть за Христа апостолів, їх учнів або інших християн, які не відреклися від Христа навіть під страхом смерті не може зявитися жодного сумніву, що ці люди удостоїлись Царства Небесного, відповівши Богу любовю та залишившись Йому вірним до кінця. Але важливість цього дня становить шанування памʼяті Всіх святих, імена яких залишилися невідомими людям, але вписані в Книгу Життя. Бо святості не визначають ні слава, ні популярність. Лише Бог знає серце кожного і Сам дарує вінець життя вірним.Сьогодні, Свята Церква, нагадує усім про те, до чого покликаний кожен християнин. Адже, ми покликані до святості. Не до великої слави, а до великої вірності.Нехай же молитвами Всіх святих Господь укріпить і нас у вірі, дарує нам силу жити свято, бути світлом у цьому світі і спадкоємцями Його Небесного Царства."
  },
  {
    "id": 2,
    "title": " Божественна літургія в день свята П'ятидесятниці, Пресвятої Тройці. 08.06.2025р. ",
    "youtubeId": "H7tHhM_E6ro",
    "description": "Християнська П’ятидесятниця має свій старозавітний прообраз, а саме однойменне іудейське свято «Πεντηκοστή» — П’ятидесятниця. Примітно, що в канонічних старозавітних книгах і традиційному іудаїзмі використовується інша назва — свято Седмиць (єврейською «Шавуот»), пов’язана з тим, що це свято звершували через сім седмиць після Пасхи. І біблійна, і церковна назви мають однакове пояснення: свято отримало таку назву внаслідок того, що завжди припадало на п’ятдесятий день після святкування Пасхи. Змістом П’ятидесятниці є спомин Зішестя Святого Духа на апостолів і таємниче народження цього дня Церкви Христової. Окрім цього, християнське свято має ще одну назву — День Святої Трійці. Ця назва виникла на досить пізньому етапі розвитку свята (приблизно з XIV століття) і пов’язана з тим, що до згадки історичної події, Зішестя Святого Духа на апостолів, додається ще один аспект, а саме прославлення Триєдиного Божества. У Стародавньому Ізраїлі це було хліборобське свято, яке збігалося за часом з початком жнив нового врожаю пшениці. У день П’ятидесятниці в жертву Богові приносили «початки» нового врожаю. На п’ятдесятий день після Воскресіння Христового Богородиця і апостоли зібралися в Сіонській горниці, щоб відсвяткувати іудейське свято П’ятидесятниці. Цього дня євреї згадували, як на п’ятдесятий день після Виходу із Єгипту Бог дарував Мойсеєві Десять заповідей на горі Синай."
  },
  {
    "id": 3,
    "title": " Патріарше богослужіння у неділю 7-му після Пасхи, свв. отців І Вселенського Собору. 01.06.2025р. ",
    "youtubeId": "9chJ1ZiOCVg",
    "description": "У 7-му неділю після Пасхи Церква вшановує пам’ять учасників Першого Вселенського собору. Його скликав імператор римський Константин Великий, який припинив гоніння на віру Христову і встановив її як державну для своєї імперії. Так починається найбагатша в історії Церкви епоха – епоха Вселенських соборів. Невідомо, скільки було отців першого з них, що зібрався в Нікеї триста двадцять п’ятого року: документів не збереглося. Але церковна традиція закріпила цифру 318. Були відомості, що справді триста вісімнадцять отців зібралося тоді. Але ще важливішим було інше: у стародавні часи, про які розповідає нам Книга Буття, зібрав Авраам триста вісімнадцять воїнів, аби визволити свого родича Лота, захопленого ворогами. Саме до цієї події уподібнили отці свій Собор – визволення Христової віри від аріанства. Вони прагнули повернути правду Євангелія Церкві і зробили це. Причому перед Собором здавалося, що більшість авторитетних єпископів піддалася єресі аріанства. І навіть після Собору деякі імператори довгий час сумнівалися. Але правда перемогла, не завдяки арифметичній сукупності людей, а завдяки тому, що і перетворює наші зібрання на Собор, а нашу громаду на церковну спільноту, – присутності благодаті Святого Духа."
  },
  {
    "id": 4,
    "title": " Патріарша Божественна літургія у день свята Вознесіння Господнього. 29.05.2025р. ",
    "youtubeId": "1pyIrhWcT8E",
    "description": "Вознесіння Господнє відзначається на сороковий день після Воскресіння Христового, тому свято завжди припадає на четвер. Цього дня ми згадуємо події, що відбулися через сорок днів після того, як Ісус Христос був розіп’ятий на хресті і воскрес. Після Воскресіння Спаситель неодноразово з’являвся Своїм учням, зміцнюючи їхню віру і готуючи до зішестя Святого Духа на них — до П’ятдесятниці. У день Вознесіння Господь зібрав апостолів у Віфанії, на Єлеонській горі. Христос благословив їх і — як був, у плоті — вознісся на небо. Христос був піднесений на небо Своєю божественною силою. Хмара, що приховала Його від очей апостольських, була не засобом перенесення, а почестю Божества, як і слава Бога у вигляді хмари наповняла скинію. «І покрила хмара скинію зібрання, і слава Господня наповнила скинію» (Вих. 40, 34). Місце Його після Вознесіння – місце «вище за всі небеса». Після Свого Воскресіння Ісус Христос кілька разів з’являвся апостолам і проповідував Царство Боже. Це було не видіння, це був живий Учитель, з плоті і крові. Свідчення того, що Спаситель дійсно воскрес із мертвих і тим самим переміг смерть. Явлення Христа були свого роду підготовкою до дня П’ятдесятниці, коли Дух Святий зійшов на них, щоб вони могли проповідувати Воскреслого Христа всьому світу. Вознесіння Христове зміцнює нашу надію. Той факт, що Христос людську природу возніс на небо, дарує нам надію, що й ми там будемо. Крім цього, Сам Христос говорив: «І коли піду й приготую вам місце, прийду знову й візьму вас до Себе, щоб і ви були там, де Я» (Ін. 14, 3)."
  },
  {
    "id": 5,
    "title": " Патріарше богослужіння у неділю 6-ту після Пасхи, про сліпого. 25.05.2025р. ",
    "youtubeId": "8ljl-JVIZaU",
    "description": "Одного разу, коли Ісус перебував у Єрусалимі, творив дива і проповідував учення Своє, вороги Його сповнилися такої люті, що хотіли побити Його камінням. «І, проходячи, побачив чоловіка, сліпого від народження. Ученики Його запитали в Нього: Учителю, хто згрішив – він чи батьки його, що сліпим народився? Ісус відповів: ні він не згрішив, ні батьки його, а це для того, щоб відкрилися на ньому діла Божі. Мені належить робити діла Того, Хто послав Мене, доки день є; прийде ніч, коли ніхто робити не зможе. Доки Я в світі, Я Світло для світу. Сказавши це, плюнув на землю, зробив із слини суміш і помазав сумішшю очі сліпому. І сказав йому: іди, вмийся у купальні Силоам, що означає: посланий. Він пішов і вмився, і прийшов зрячим. Сусіди і ті, що бачили його раніше, як він був сліпим, говорили: чи не той це, що сидів і просив? Одні говорили, що це той; інші ж – що схожий на нього. Він же сказав: це я. Тоді запитали в нього: як відкрилися в тебе очі? Він казав їм у відповідь: Чоловік, Якого звуть Ісус, зробив суміш, помазав очі мої і сказав мені: іди в купальню Силоам і вмийся. Я пішов, умився і прозрів. Тоді сказали йому: де ж Він? Він відповів: не знаю. Повели цього колишнього сліпця до фарисеїв. А була субота, коли Ісус зробив суміш і відкрив йому очі. Спитали його також фарисеї, як він прозрів. Він же сказав їм: суміш поклав Він на мої очі, і я вмився і бачу."
  },
  {
    "id": 6,
    "title": "Патріарше богослужіння у неділю 5-ту після Пасхи, про самарянку. 18.05.2025р.",
    "youtubeId": "DYeKqA4VSvo",
    "description": "Перебуваючи з учнями в Самарії, Господь послав їх у селище, а сам лишився біля колодязя праотця Якова. Туди ж прийшла жінка, щоб набрати води. Господь, попри те, що юдеї вважали неприпустимим навіть розмову з самарянами, почав з нею говорити і розповів їй таємниці її життя – про те, що мала вона п’ятьох чоловіків. Здивована цим, жінка продовжила розмову, і тоді Христос попросив у неї води та додав, що, якби вона знала, з Ким говорить, то сама просила б у Нього іншої води – живої: «Хто буде пити воду, яку Я дам йому, – звертається до самарянки і до всіх нас Христос, – ніколи вже не матиме спраги, бо вода, яку Я дам йому, стане в ньому джерелом води, яка тече в життя вічне…» Ця жива вода – віра Христова, від якої всі отримують благодатні дари Божої Любові та Духа Святого. Отримала цей дар і Євангельська самарянка, яка, за переданням Церкви, все подальше життя присвятила проповіді Євангелія та постраждала за це в 66 році – була вкинута мучителями в колодязь."
  },
  {
    "id": 7,
    "title": "Божественна літургія у день пам'яті священномученика Макарія, митрополита Київського. 14.05.2025р.",
    "youtubeId": "-v1SE_55xK8",
    "description": "Священномученик Макарій, митрополит Київський і всієї Руси жив у XV столітті. Про те, де саме народився майбутній Святитель, немає достатніх відомостей. Відомо, що батьки виховали його у православній вірі. В юнацькі роки він ніс послух у київських монастирях, в одному з яких прийняв чернечий постриг, а згодом переїхав до Вільно (Вільнюс). Близько 1478 року він стає архімандритом Віленського Свято-Троїцького монастиря та митрополичим намісником над усіма православними монастирями і церквами Литовського Князівства. У 1495 році, після смерті Київського митрополита Іони (Глезни), Собором руських (українських) архієреїв відбулося поставлення архімандрита Макарія митрополитом. Для одержання благословення до Константинопольського Патріарха Нифонта були послані старець Діонісій і чернець Герман. 1496 року Патріарх надіслав Великому князеві, княгині та митрополиту Макарію листа з благословенням.Митрополит Макарій був ревним пастирем, стежив за дисципліною духовенства, намагався підвищити моральний рівень священнослужителів своєї Митрополії, але до порушників церковної дисципліни та християнської моралі був дуже суворим. Багато допомагав він нужденним. Також Святитиль виступав на захист Православної Церкви від католицьких можновладців."
  },
  {
    "id": 8,
    "title": "Патріарше богослужіння у неділю 4-ту після Пасхи, про розслабленого. 11.05.2025р.",
    "youtubeId": "UKReXD_uXYE",
    "description": "Подія оздоровлення розслабленого ще раз навчає нас, що тільки з Божою допомогою ми зможемо впевнено і успішно вирішувати навіть найважчі життєві справи. У цьому нас переконують слова псалмоспівця: «Не надійтеся на князів, на синів людських, в них нема спасіння. Вийде дух його і вернеться в землю свою; в той день загинуть усі помисли його. Блажен, кому Бог Якова — помічник його; у кого надія на Господа Бога свого» (Пс. 145:3-5). А людина, яка уповає на Бога, ніколи не посоромиться, тому що єдиний Бог – вічний, правдивий, не помиляється, Він завжди вірний у своїх словах: «Уповайте на Господа повіки, бо Господь Бог є твердиня вічна» (Іс. 26:4). "
  },
  {
    "id": 9,
    "title": "Патріарше богослужіння у неділю 3-тю після Пасхи, святих праведних жон-мироносиць. 04.05.2025р.",
    "youtubeId": "qXiLuR1nPcA",
    "description": "У 3-ю неділю після Пасхи Свята Церква згадує святих жон-мироносиць і праведних Йосифа Аримафейського і Никодима - таємних учнів Христових. Своїм богослужінням Церква знову поставляє нас на Голгофі біля Хреста Христового, з якого знімають Пречисте Його Тіло Йосиф і Никодим, і в саду в гробі, де вони покладають Тіло Ісуса Христа, і де потім мироносиці, що прийшли помазати Тіло запашними маслами, першими удостоюються бачити Воскреслого Господа. За прикладом святих жон-мироносиць і ми повинні зігрівати у серці своєму справжню самовіддану любов до Спасителя нашого, щоб, як каже Апостол (Рим.8.38-39), ніщо не могло відлучити нас від Нього - ні сьогоднішнє, ні майбутнє, ні життя, ні смерть, ні ангели, ні люди. Крім того, як святі жони, уражені лютою скорботою побачивши розіп’ятого Господа, шукали і знайшли утіху в Його ж гробі, так і кожна християнська душа повинна шукати утіху в скорботах і печалях біля гробу хреста Спасителя свого."
  },
  {
    "id": 10,
    "title": "Патріарша Божественна літургія і панахида у неділю 2-гу після Пасхи, ап. Фоми. 27.04.2025р.",
    "youtubeId": "6LztxusZLYY",
    "description": "У другу неділю після Пасхи Христової, яку ми називаємо Антипасхою та Фоминою неділею, у читанні зЄвангелія ми чуємо про віру та невірʼя апостола Фоми, бо він був людиною. Фома був рибалкою, котрий почувши благовістя Господа Бога і Спасителя нашого Ісуса Христа залишає цю справу та стає одним з 12 найближчих апостолів (учнів) Спасителя. Великою була його любов до Вчителя, про що свідчить те, що коли Христос збирався до Іудеї, щоб воскресити Лазаря, а апостоли відмовляли, бо були чутки про можливе вбивство Спасителя, то тільки лише Фома сказав: «Ходімо й ми, щоб померти з Ним» (Ін. 11:16). Але ми знаємо й інше з Євангелія: коли єврейські воїни арештували Ісуса Христа у Гефсиманському саду, то Фомазлякався і втік разом з іншими апостолами. Воскреслий Спаситель приходить до своїх апостолів увечері у день Свого воскресіння, котрі отримавши вістку про порожню гробницю Христа, перебували у страхові танепевності. Спаситель приходить та приносить повноту радості: Той, Якого вони любили і вважали мертвим, стоявживим між ними і торкався їхніх рук Своїми; Той, Якого вонизалишили у найважчі часи Його земного життя, стояв перед ними без грізного погляду та жодного докору. Журба апостолів обернулася у торжество радості, бо вони зновупобачили свого Вчителя і вже ніхто не міг відібрати від них цієї радості. Дорогі у Христі! А що ж Фома? Його не було між апостолами у цей світлий вечір. Дивно це, адже апостоли перебували разом з великим острахом у закритій оселі, а Фома залишив будинок. Можливо він намагався збагнути, куди поділося тіло Спасителя, а можливо шукав, хто би міг його вкрасти, а можливо потребував усамітнення.    Надалі очевидно, що Фома відчуває певну образу, коли дізнається, що Господь явився всім апостолам, окрім нього. Він відмовляється вірити у воскресіння Христове, хоча, насправді, у глибині серця йому хотілося обернути свою журбу на радості. Христос же зволікає із Своїм обʼявленнямапостолові, не приходить до нього у той самий день, коли Фома поставив умови своєї віри: «Якщо не побачу на руках Його рани від цвяхів, і не вкладу пальця мого в рани від цвяхів, і не вкладу руки моєї у ребра Його, – не повірю» (Ін. 20:25). Христос зʼявляється апостолу Фомі аж через вісім днів, котрий мав доволі часу щоб прийти до віри без того, щоб побачити і торкнутися, однак він залишається вірним своєму невірству, бо він людина. Спаситель не залишає Свого вибраного у невірстві, кажучи Фомі: «Дай палець твій сюди і подивись на руки Мої; подай руку твою і вклади в ребра Мої, і не будь невіруючим, але віруючим» (Ін. 20:27). Фома у невимовній радості вигукує наступні слова: «Господь мій і Бог мій!» (Ін. 20:28)."
  },
  {
    "id": 11,
    "title": "Пасхальна вечірня та привітання Патріарха Філарета зі святом Великодня. 20.04.2025р.",
    "youtubeId": "KmirNYiAxRo",
    "description": "“Ваше високопреосвященство, всечесні отці, дорогі браття і сестри, Христос Воскрес! Ми повторюємо безліч разів ці слова: «Христос Воскрес», але рідко усвідомлюємо що вони значать. Яке значення вони мають для кожного із нас? Мають велике значення, бо якби Христос не воскрес, то існували б ми у пеклі. А чому б ми знаходились у пеклі? А тому, що ми мали б не вилікувану пошкоджену гріхом природу і, продовжуючи грішити, знаходились би в пеклі, бо гріхи вимагають покарання. Але Господь наш Ісус Христос Воскрес. Це значить, що Він переміг смерть, тобто визволив людську природу від смерті. Ви скажете: «ми ж помираємо, хоч і Христос Воскрес», помираємо але ми всі воскреснемо. Але воскреснемо для якого життя? Життя різне, є життя вічне – блаженне, а є вічне життя – страждальне. Але від кого залежить наше вічне життя? Звичайно, що все залежить від Бога. Але від нас залежить найперше, бо якщо ми проводимо життя на землі благочестиво, то життя вічне буде блаженним, а якщо проводимо нечестиве життя, в гріхах, то вічне життя успадкуємо, але страждальне. І страждати будемо вічно. Тому це спонукає всіх нас на землі вибирати добро, а не зло. Вибрав зло – не скаржся ні на кого, і на Бога у тому числі, бо ти сам захотів страждати. Тебе ж у пекло ніхто не посилав, ти ж добровільно в це пекло пішов, через свої злі діла. Не будеш чинити зла – будеш вічно жити в блаженнстві, а якщо на землі будеш звершувати зло, то будеш страждати вічно. І ніхто тебе уже не спасе. Ось ми часто повторюємо: «Страшний суд», а чому він Страшний, що в ньому сташного? А Страшний він тому, що він незмінний, тут суд навіть і після смерті може бути змінений через покаяння, через молитви церкви, через молитви близьких може бути змінений. А після того суду ніякої зміни не буде, потому і страшно. Тому, дорогі браття та сестри, ми повинні піклуватися не тільки про своє спасіння, а піклуватися і про спасіння своїх ближніх. Якщо будемо піклуватися про їх спасіння, то тим самим будемо спасти і себе. Яким чином? Виявляючи любов ми звільняємося від пекла. І тому ми і молимось, щоб Господь допоміг нам визволитися від майбутніх страждань вже тут на землі. Все це ми повинні знати і вчити інших, тубуючись і про їх спасіння. Цим ми виявимо любов до ближніх і Господь дасть нам Царство Небесне, блаженне життя. Чого ми хочемо і молимось про це. І Господь помилує нас, обов’язково помилує як і колись розбійника. Тому будемо молитися про прощення наших гріхів і виявляти свою щиру любов до ближніх, щоб Господь дарував нам блаженне Царство Небесне”,"
  },
  {
    "id": 12,
    "title": "Патріарше пасхальне богослужіння у Володимирському соборі. 20.04.2025р.",
    "youtubeId": "Z4g-hcBVguM",
    "description": "20 квітня 2025 року Православна Церква відзначала найбільше свято – Пасху Христову, Воскресіння Господа нашого Ісуса Христа. У ніч з суботи на неділю Святійший Патріарх Київський і всієї Руси-України Філарет у Володимирському кафедральному соборі звершив Пасхальні богослужіння – полуношницю, хресний хід, великодню ранню та Божественну літургію святителя Іоана Золотоустого. Під час великодньої відправи Патріарху Філарету співслужили настоятель храму протоієрей Борис Табачек та клірики кафедрального собору. Незадовго до опівночі Патріарх із духовенством вийшли на хресний хід навколо собору, який за уставом завершився перед закритими дверима храму, що символізують собою закритий Гріб Господній. Тут розпочалася Пасхальна рання і вперше цього року було проголошено: «Христос Воскрес». Далі Святійший Патріарх та духовенство увійшли до храму, де рання продовжилась каноном Воскресінню Христовому. Після співу екзапостиларію Пасхи протоієрей Олександр Шмуригін прочитав цьогорічне Пасхальне послання Святійшого Патріарха Філарета. Потім після співу стихир Пасхи протоієрей Михаїл Трускавецький виголосив Огласительне слово святителя Іоана Золотоустого. Ця Пасхальна проповідь, виголошена великим учителем Церкви ще у ІV столітті, читається у храмах щороку у день свята Світлого Христового Воскресіння. Після ранньої Святійший Патріарх очолив служіння Божественної літургії. За богослужінням підносились особливі посилені молитви за Україну: наших воїнів-захисників та весь побожний український народ. Духовенство і віряни підносили свої сердечні молитви, щоб Господь Бог звільнив Україну від нашестя російського агресора, оберігав та зміцнював дух наших воїнів-захисників, а також подав українському народові благословенний справедливий мир і перемогу. За богослужінням співав Патріарший хор (регент Вероніка Матвієнко) та кліросний хор Володимирського собору (регент Віра Білорус). Богослужіння завершилося освяченням артосів (пасхальних хлібів, які знаходяться біля вівтаря у храмі впродовж Світлого тижня, а у Світлу суботу роздаються вірним), а також пасок і великодніх приношень."
  }
]
