[
  {
    "date": "Квітень 2025 р.",
    "events": [
      {
        "id": 1,
        "type": "video",
        "title": "Богослужіння свята Пасхи ",
        "youtubeId": "_HcNAWIpifk",
        "description": "20 Квітня 2025"
      }
    ]
  },
  {
    "date": "Квітень 2025 р.",
    "events": [
      {
        "id": 2,
        "type": "video",
        "title": "Божественна літургія у Світлий понеділок ",
        "youtubeId": "M744TTVdpeY",
        "description": "21 Квітня 2025"
      }
    ]
  },
  {
    "date": "Квітень 2025 р.",
    "events": [
      {
        "id": 3,
        "type": "video",
        "title": " Предстоятель очолює Божественну літургію у другу неділю після Пасхи ",
        "youtubeId": "-BcRsgRRYGU",
        "description": "27 Квітня 2025"
      }
    ]
  },
  {
    "date": "Травень 2025 р.",
    "events": [
      {
        "id": 4,
        "type": "video",
        "title": "Блаженнійший Митрополит Епіфаній очолює Божественну літургію у третю неділю після Пасхи",
        "youtubeId": "txqf3_XqoUc",
        "description": "04 Травня 2025 "
      }
    ]
  },
  {
    "date": "Травень 2025 р.",
    "events": [
      {
        "id": 5,
        "type": "video",
        "title": "Божественна літургія у Свято-Миколаївському Жидичинському монастирі ",
        "youtubeId": "T1VBLuuOLXQ",
        "description": "09 Травня 2025"
      }
    ]
  },
  {
    "date": "Травень 2025 р.",
    "events": [
      {
        "id": 6,
        "type": "video",
        "title": "Божественна літургія у Кирилівській церкві",
        "youtubeId": "_l-qK2agYhU",
        "description": " 11 Травня 2025"
      }
    ]
  },
  {
    "date": "Травень 2025 р.",
    "events": [
      {
        "id": 7,
        "type": "video",
        "title": "Божественна літургія в день пам'яті святителя Епіфанія Кіпрського",
        "youtubeId": "k7mdZfhzKn0",
        "description": "12 Травня 2025 "
      }
    ]
  },
  {
    "date": "Травень 2025 р.",
    "events": [
      {
        "id": 8,
        "type": "video",
        "title": "Божественна літургія у шосту Неділю після Пасхи та в 25-ту річницю відновлення Михайлівського Собору",
        "youtubeId": "zUSXc2qIolo",
        "description": "25 Травня 2025"
      }
    ]
  },
  {
    "date": "Травень 2025 р.",
    "events": [
      {
        "id": 9,
        "type": "video",
        "title": "Божественна літургія в день свята Вознесіння Господнього",
        "youtubeId": "01P52jUY-yc",
        "description": "29 Травня 2025 "
      }
    ]
  },
  {
    "date": "Червень 2025 р.",
    "events": [
      {
        "id": 10,
        "type": "video",
        "title": "Божественна літургія у сьому неділю після Пасхи ",
        "youtubeId": "_5X3g1VOqvU",
        "description": "01 Червня 2025"
      }
    ]
  },
  {
    "date": "Червень 2025 р.",
    "events": [
      {
        "id": 11,
        "type": "video",
        "title": "Божественна літургія в день Святої Тройці.",
        "youtubeId": "u390ck-JeOA",
        "description": "08 Червня 2025"
      }
    ]
  },
  {
    "date": "Червень 2025 р.",
    "events": [
      {
        "id": 12,
        "type": "video",
        "title": "Божественна літургія у храмі Воздвиження Чесного Хреста Господнього міста Тернополя",
        "youtubeId": "YyLKKgSaYGs",
        "description": "15 Червня 2025"
      }
    ]
  },

  {
    "date": "Червень 2025 р.",
    "events": [
      {
        "id": 13,
        "type": "video",
        "title": "Божественна літургія у Петропавлівському храмі в Києві",
        "youtubeId": "g1ibCUD5daI",
        "description": "29 Червня 2025"
      },
      {
        "id": 14,
        "type": "images",
        "title": "Коли людина щиро прагне пізнати істину – Бог відкриває їй це пізнання.",
        "images": [
          {
            "thumb": "/assets/news/june292025/thumb/dsc_0088-350x197.jpg",
            "full": "/assets/news/june292025/dsc_0088.jpg"
          },
          {
            "thumb": "/assets/news/june292025/thumb/dsc_0090-350x197.jpg",
            "full": "/assets/news/june292025/dsc_0090.jpg"
          },
          {
            "thumb": "/assets/news/june292025/thumb/dsc_0095-350x197.jpg",
            "full": "/assets/news/june292025/dsc_0095.jpg"
          },
          {
            "thumb": "/assets/news/june292025/thumb/dsc_0103-350x197.jpg",
            "full": "/assets/news/june292025/dsc_0103.jpg"
          },
          {
            "thumb": "/assets/news/june292025/thumb/dsc_0105-2-350x197.jpg",
            "full": "/assets/news/june292025/dsc_0105-2.jpg"
          }
        ],
        "description": "Проповідь Блаженнійшого Митрополита Київського і всієї України Епіфанія в день пам’яті святих першоверховних апостолів Петра і Павла. \n Дорогі брати і сестри! Слава Ісусу Христу! Нині ми вшановуємо спільну пам’ять двох великих подвижників віри, проповідників Євангелія, двох мучеників за Христа, які залишили своє попереднє життя і на заклик Спасителя цілком присвятили себе служінню Істині. Тож сердечно вітаю усіх, а особливо громаду цього храму, зі святом першоверховних апостолів Петра і Павла. Апостоли Петро і Павло як особистості досить істотно відрізнялися один від одного. Симон, якого Христос пізніше назвав Петром, тобто Каменем, був простого походження, займався рибальством. Савл, який після навернення до Христа і початку своєї апостольської проповіді став більше відомий під своїм римським громадянським іменем Павла, походив з роду фарисеїв, з юнацтва був відданий вивченню закону Мойсеєвого і юдейських передань. Петро був покликаний одним з перших до апостольства. Натомість нема жодних свідчень того, що Павло бачив Спасителя у дні Його земного життя. Петро відрізнявся гарячністю у справах віри – побачивши Христа, коли Він йшов по воді, просив звеліти і йому йти назустріч; першим з апостолів відкрито визнав Ісуса за Сина Божого, а перед хресними стражданнями виявляв готовність йти навіть на смерть зі Спасителем. Однак ця гарячність привела його до страшної помилки: бажаючи якнайдовше бути з Учителем, Петро, щоби його не вигнали, перед слугами первосвященника тричі відрікся від Ісуса, нібито він не знає Його. Натомість Савл був ревним і щирим послідовником фарисейського вчення. Почувши про Ісуса з Назарету, Якого багато хто вже визнавав за Месію, Савл вважав своїм обов’язком протидіяти цьому новому вченню, вважаючи його зневагою для закону Мойсея. Тому Савл схвалював вбивство диякона Стефана і сам брав участь у гонінні на перших християн, навіть просив для себе повноваження йти у Дамаск, щоби і там переслідувати їх. Отже, і Петро, і Павло, хоча були ревнителями віри так, як вони її розуміли, не змогли уникнути у своєму житті великих духовних помилок. Однак Господь, бачачи, що насправді вони діяли так не від злого задуму, але через нерозумну ревність, не залишив їх у темряві омани і дав можливість для покаяння та навернення. Відтак Петро, який ще недавно боявся навіть слуг первосвященника, став безбоязно проповідувати Євангеліє перед натовпом народним і навіть перед синедріоном. Павло, якому на дорозі в Дамаск явився Господь, повністю відкинув свої попередні фарисейські переконання та став одним з найбільш ревних проповідників слова Божого, написав більшу частину книг Нового Завіту, заснував численні місцеві Церкви у Малій Азії та в Європі, зокрема і в Римі. Обидва апостоли постраждали під час гоніння, яке римський імператор Нерон підняв проти християн. Петро у Римі був розіп’ятий на хресті на арені цирку на Ватиканському пагорбі. Павло, як римський громадянин, був захищений від цієї болючої ганебної страти, тому смертний вирок виконали над ним там же, у Римі, відтявши йому голову мечем. Тіла святих апостолів були поховані християнами, а пам’ять їхню Церква шанувала від давнього часу. Коли ж завершилася епоха гонінь і римська держава при владі імператора Костянтина сама стала християнською – на честь Петра і Павла у Римі був збудований храм, день освячення якого, як вважається, і став цим днем спільної пам’яті двох першоверховних апостолів. І нині ми знову святкуємо цей день для того, щоби не лише згадати життя і подвиги Петра і Павла, але також нагадати собі їхні численні духовні настанови, зокрема викладені у їхніх посланнях, та зробити для себе кілька важливих висновків. Перший з них є той, що Господь кличе до себе і приймає всяку людину, незалежно від її попереднього життя та походження, навіть незалежно від її попередніх гріхів. Коли людина щиро прагне пізнати істину – Бог відкриває їй пізнання істини, як відкрив її Петру та Павлу, хоча і здійснив це у різний спосіб. Наступний урок полягає в тому, що Церква, до якої всі ми належимо, є Церква Христова. Хоча апостоли Петро і Павло, а також інші апостоли багато потрудилися для проповіді Євангелія та творення перших церковних громад, але вони не є і не можуть бути основою Церкви, бо Єдиним її засновником і Главою є Син Божий, Господь Ісус Христос. Саме тому, щоби підкреслити, що істина Євангелія походить не від людини, але від Бога, Спаситель відкрив цю істину не одному зі своїх учнів, але багатьом, покликавши спочатку 12, а потім ще 70 до апостольства. Однак Павло не належав ані до числа перших, ані до числа других – і все ж іменується першоверховним апостолом, як і Петро. І це є третій урок – першість в Церкві залежить від першості в праці та служінні, а не від зовнішніх людських ознак. Петро став першим серед 12 апостолів не за часом свого покликання, не за походженням чи вченістю – бо не мав тут чим хвалитися, як простий рибалка, – але першим став завдяки найбільш полум’яній вірі, готовності завжди і в усьому йти за Спасителем. Водночас рівного з ним звання апостольського і рівної слави досяг Павло, який навернувся пізніше, однак потрудився, як він сам свідчить – найбільше. А це означає для нас, що не зовнішнє людське звання чи становище є визначними у вірі, але відданість, ревність служіння, любов та жертовність. Відтак ніхто нехай не спокушається, навіть якщо бачить у своєму попередньому житті численні гріхи та не має чеснот, якими би міг втішатися. Ніколи і ні для кого, доки живе людина, не закритий шлях до навернення, до покаяння та істотної зміни життя. Те, як перемінилося життя Петра і Павла, те, як Господь прийняв покаяння їх обох та з грішників зробив їх великими святими, повинне і кожного з нас надихати на боротьбу з власними недоліками та гріхами, на виправлення власних помилок. Бо коли справді будемо прагнути пізнати істину і жити за нею – Господь також подасть нам це пізнання, як подав Петру і Павлу та багатьом іншим.  Господь зміцнить нас на вірному життєвому шляху, як це Він зробив для апостолів Петра і Павла. Їхніми ж молитвами нехай Він помилує усіх нас. Амінь."
      }
    ]
  },
  {
    "date": "Червень 2025 р.",
    "events": [
      {
        "id": 15,
        "type": "video",
        "title": "Божественна літургія у п’яту неділю після П’ятидесятниці",
        "youtubeId": "Ru92BSkwPNI",
        "description": "13 Липня 2025 "
      }
    ]
  },
  {
    "date": "Червень 2025 р.",
    "events": [
      {
        "id": 16,
        "type": "video",
        "title": " Привітання Предстоятеля з 1037-ю річницею хрещення України-Руси!",
        "youtubeId": "EB04ZELu4z8",
        "description": "15 Липня 2025 "
      }
    ]
  },

  {
    "date": "Липень 2025 р.",
    "events": [
      {
        "id": 17,
        "type": "images",
        "title": "Вінниця. Храм св. прп. Серафима Саровського чудотворця. Храмове свято.",
        "images": [
          {
            "thumb": "/assets/news/July192025/thumb/DSC_1213.jpg",
            "full": "/assets/news/July192025/DSC_1213.JPG"
          },
          {
            "thumb": "/assets/news/July192025/thumb/DSC_1214.jpg",
            "full": "/assets/news/July192025/DSC_1214.JPG"
          },
          {
            "thumb": "/assets/news/July192025/thumb/DSC_1215.jpg",
            "full": "/assets/news/July192025/DSC_1215.JPG"
          },
          {
            "thumb": "/assets/news/July192025/thumb/DSC_1216.jpg",
            "full": "/assets/news/July192025/DSC_1216.JPG"
          },
          {
            "thumb": "/assets/news/July192025/thumb/DSC_1217.jpg",
            "full": "/assets/news/July192025/DSC_1217.JPG"
          },
          {
            "thumb": "/assets/news/July192025/thumb/DSC_1218.jpg",
            "full": "/assets/news/July192025/DSC_1218.JPG"
          },
          {
            "thumb": "/assets/news/July192025/thumb/DSC_1219.jpg",
            "full": "/assets/news/July192025/DSC_1219.JPG"
          },
          {
            "thumb": "/assets/news/July192025/thumb/DSC_1220.jpg",
            "full": "/assets/news/July192025/DSC_1220.JPG"
          },
          {
            "thumb": "/assets/news/July192025/thumb/DSC_1221.jpg",
            "full": "/assets/news/July192025/DSC_1221.JPG"
          }
        ],
        "description": "19 липня 2025"
      },
      {
        "id": 18,
        "type": "video",
        "title": "Вінниця. Храм св. прп. Серафима Саровського чудотворця. Хресна хода",
        "youtubeId": "YginJzYkfgo",

        "description": "19 Липня 2025"
      }
    ]
  },

  {
    "date": "Серпень 2025 р.",
    "events": [
      {
        "id": 19,
        "type": "images",
        "title": "Свято Преображення Господнього.",
        "images": [
          {
            "thumb": "/assets/news/2025-08-06/thumbs/DSC_1226.jpg",
            "full": "/assets/news/2025-08-06/DSC_1226.JPG"
          },
          {
            "thumb": "/assets/news/2025-08-06/thumbs/DSC_1229.jpg",
            "full": "/assets/news/2025-08-06/DSC_1229.JPG"
          },
          {
            "thumb": "/assets/news/2025-08-06/thumbs/DSC_1230.jpg",
            "full": "/assets/news/2025-08-06/DSC_1230.JPG"
          },

          {
            "thumb": "/assets/news/2025-08-06/thumbs/DSC_1233.jpg",
            "full": "/assets/news/2025-08-06/DSC_1233.JPG"
          }
        ],
        "description": "6 серпня 2025"
      },
      {
        "id": 20,
        "type": "video",
        "title": " Освячення плодів на свято Преображення Господнього.",
        "youtubeId": "aq4VXNihSr8",

        "description": "6 серпня 2025"
      }
    ]
  },

  {
    "date": "Серпень 2025 р.",
    "events": [
      {
        "id": 21,
        "type": "video",
        "title": " Неділя 9-а після П'ятдесятниці.",
        "youtubeId": "Zb5IkTonJWE",

        "description": "10 серпня 2025"
      }
    ]
  },
  {
    "date": "Серпень 2025 р.",
    "events": [
      {
        "id": 22,
        "type": "video",
        "title": "УСПІННЯ ПРЕСВЯТОЇ ВЛАДИЧИЦІ НАШОЇ БОГОРОДИЦІ І ПРИСНОДІВИ МАРІЇ",
        "youtubeId": "twEPILZ1Iq4",
        "description": "15 серпня 2025"
      }
    ]
  },
  {
    "date": "Серпень 2025 р.",
    "events": [
      {
        "id": 23,
        "type": "video",
        "title": "Неділя 10-а після П'ятдесятниці.",
        "youtubeId": "sMSMGbndAlI",
        "description": "17 серпня 2025"
      }
    ]
  },

  {
    "date": "Серпень 2025 р.",
    "events": [
      {
        "id": 24,
        "type": "video",
        "title": "Неділя 11-а після П'ятдесятниці.",
        "youtubeId": "Izo6yn9Ahtw",
        "description": "24 серпня 2025"
      }
    ]
  },
  {
    "date": "Серпень 2025 р.",
    "events": [
      {
        "id": 25,
        "type": "video",
        "title": "Символ Віри.",
        "youtubeId": "9803J3-eb_U",
        "description": "31 серпня 2025"
      }
    ]
  },
  {
    "date": "Серпень 2025 р.",
    "events": [
      {
        "id": 26,
        "type": "video",
        "title": "Отче Наш.",
        "youtubeId": "fZ-5a5EKO7k",
        "description": "31 серпня 2025"
      }
    ]
  },
  {
    "date": "Серпень 2025 р.",
    "events": [
      {
        "id": 27,
        "type": "video",
        "title": "Неділя 12-а після П'ятдесятниці.",
        "youtubeId": "xS3w2EK2Sbc",
        "description": "31 серпня 2025"
      }
    ]
  },
  {
    "date": "Вересень 2025 р.",
    "events": [
      {
        "id": 28,
        "type": "video",
        "title": "Неділя 13-а після П'ятдесятниці.",
        "youtubeId": "dqIjyetU_UM",
        "description": "07 вересня 2025"
      }
    ]
  },
  {
    "date": "Вересень 2025 р.",
    "events": [
      {
        "id": 29,
        "type": "video",
        "title": "Неділя 14-а після П'ятдесятниці. ВОЗДВИЖЕННЯ ЧЕСНОГО I ЖИВОТВОРЧОГО ХРЕСТА ГОСПОДНЬОГО.",
        "youtubeId": "DWXCrXDby6o",
        "description": "14 вересня 2025"
      }
    ]
  },
  {
    "date": "Вересень 2025 р.",
    "events": [
      {
        "id": 30,
        "type": "video",
        "title": "Отче Наш. 21 вересня 2025 ",
        "youtubeId": "FcpEfAfvxW0",
        "description": "Отче наш, що єси на небесах! Нехай святиться ім'я Твоє, нехай прийде Царство Твоє, нехай буде воля Твоя, як на небі, так і на землі. Хліб наш насущний дай нам сьогодні і прости нам провини наші, як і ми прощаємо винуватцям нашим, і не введи нас у спокусу, але визволи нас від лукавого. Бо Твоє є Царство, і сила і слава, Отця, і Сина, і Святого Духа, нині й повсякчас, і на віки вічні. Амінь. "
      }
    ]
  },
  {
    "date": "Вересень 2025 р.",
    "events": [
      {
        "id": 31,
        "type": "video",
        "title": "Неділя 15-та після П'ятдесятниці. 21 вересня 2025 ",
        "youtubeId": "yTzGE4vsNgE",
        "description": "Євангеліє від Матвія 22:34-46 \n А фарисеї, почувши, що Він заткав уста саддукеям, зібралися разом. І один із них, учитель Закону, запитав, щоб випробувати Його: «Учителю, котра найбільша заповідь у Законі?»  А Він йому відповів: «Люби Господа, Бога свого, всім серцем твоїм, і всією душею твоєю, і всією своєю думкою. Це найбільша й найперша заповідь. А друга, подібна до неї: люби ближнього свого, як самого себе. На цих двох заповідях утверджується весь Закон і Пророки»."
      }
    ]
  },
  {
    "date": "Вересень 2025 р.",
    "events": [
      {
        "id": 32,
        "type": "video",
        "title": "Неділя 16-та після П'ятдесятниці. 28 вересня 2025",
        "youtubeId": "rqoPZqJDZ9A",
        "description": "Євангеліє від Матвія Матвія 25:14-30 \n Притча про таланти  «Так само ж один чоловік, як відходив, покликав своїх рабів і передав їм добро своє. І одному він дав п’ять талантів, а другому два, а тому один, кожному за спроможністю його. І відійшов. А той, що взяв п’ять талантів, негайно пішов і орудував ними, і набув він п’ять інших талантів. Так само ж і той, що взяв два і він ще два інших набув. А той, що одного взяв, пішов та й закопав його в землю, і сховав срібло пана свого. По довгому ж часі вернувся пан тих рабів, та й від них зажадав обрахунку. І прийшов той, що взяв п’ять талантів, приніс іще п’ять талантів і сказав: Пане мій, п’ять талантів мені передав ти, ось я здобув інші п’ять талантів. Сказав же йому його пан: Гаразд, рабе добрий і вірний! Ти в малому був вірний, над великим поставлю тебе, увійди до радощів пана свого! Підійшов же й той, що взяв два таланти, і сказав: Два таланти мені передав ти, ось іще два таланти здобув я. казав йому пан його: Гаразд, рабе добрий і вірний! Ти в малому був вірний, над великим поставлю тебе, увійди до радощів пана свого! Підійшов же і той, що одного таланта взяв, і сказав: Я знав тебе, пане, що тверда ти людина, ти жнеш, де не сіяв, і збираєш, де не розсипав. І я побоявся, пішов і таланта твого сховав у землю. Ото маєш своє… І відповів його пан і сказав йому: Рабе лукавий і лінивий! Ти знав, що я жну, де не сіяв, і збираю, де не розсипав? Тож тобі було треба віддати гроші мої грошомінам, і, вернувшись, я взяв би з прибутком своє. Візьміть же від нього таланта, і віддайте тому, що десять талантів він має. Бо кожному, хто має, дасться йому та й додасться, хто ж не має, забереться від нього й те, що він має. А раба непотрібного вкиньте до зовнішньої темряви, буде плач там і скрегіт зубів!»"
      }
    ]
  }
]
