[
  {
    "id": "otche-nash",
    "title": "Отче наш",
    "article": [
      "Отче наш, що єси на небесах!",
      "Нехай святиться ім’я Твоє,",
      "Нехай прийде Царство Твоє,",
      "Нехай буде воля Твоя,",
      "Як на небі, так і на землі.",
      "Хліб наш насущний дай нам сьогодні,",
      "І прости нам провини наші,",
      "Як і ми прощаємо винуватцям нашим.",
      "І не введи нас у спокусу,",
      "Але визволи нас від лукавого.",
      "Бо Твоє є царство, і сила, і слава навіки.",
      "Амінь."
    ],
    "youtubeId": "FcpEfAfvxW0"
  },
  {
    "id": "simvol-viry",
    "title": "Символ Віри",
    "article": [
      "Вірую в Єдиного Бога, Отця, Вседержителя, Творця неба і землі, всього видимого і невидимого.",
      "І в Єдиного Господа Ісуса Христа, Сина Божого, Єдинородного, від Отця нарожденного перше всіх віків: Світла від Світла, Бога Істинного від Бога Істинного, рожденого, несотвореного, єдиносущного з Отцем, що через Нього все сталося.",
      "Він ради нас людей і ради нашого спасіння зійшов з небес і воплотився від Духа Святого і Марії Діви і став Людиною.",
      "Розп’ятий був за нас при Понтії Пілаті, і страждав і був похований.",
      "І воскрес на третій день, як було написано.",
      "І вознісся на небеса і сидить праворуч Отця.",
      "І знову прийде зі славою судити живих і мертвих, і Царству Його не буде кінця.",
      "І в Духа Святого, Господа, Животворящого, що від Отця походить, що Йому з Отцем і Сином однакове поклоніння і однакова слава, що говорив через пророків.",
      "В єдину, Святу, Соборну і Апостольську Церкву.",
      "Сповідую одне Хрещення на відпущення гріхів.",
      "Чекаю воскресіння мертвих",
      "і життя майбутнього віку. Амінь."
    ],
    "youtubeId": "9803J3-eb_U "
  },
  {
    "id": "boje-velykyj-edynyj",
    "title": "Боже Великий Єдиний",
    "article": [
      "Боже великий, єдиний,",
      "Нам Україну храни,",
      "Волі і світу промінням",
      "Ти її осіни.",
      "",
      "Світлом науки і знання",
      "Нас, дітей, просвіти,",
      "В чистій любові до краю,",
      "Ти нас, Боже, зрости.",
      "",
      "Молимось, Боже єдиний,",
      "Нам Україну храни,",
      "Всі свої ласки-щедроти",
      "Ти на люд наш зверни.",
      "",
      "Дай йому волю, дай йому долю,",
      "Дай доброго світу,",
      "Щастя дай, Боже, народу",
      "І многая, многая літа."
    ],
    "youtubeId": "e4rW6cxRT_M"
  },
  {
    "id": "molytva-mytarya",
    "title": "Молитва митаря",
    "article": ["Боже, будь милостивий до мене, грішного."],
    "youtubeId": ""
  },
  {
    "id": "50-psalom",
    "title": "50-й псалом",
    "article": [
      "Помилуй мене, Боже, з великої милості Твоєї і з великого милосердя Твого прости провини мої.",
      "Особливо омий мене від беззаконня мого і від гріха мого очисти мене.",
      "Бо беззаконня моє я знаю, і гріх мій повсякчас переді мною.",
      "Проти Тебе Єдиного я згрішив і лукаве перед Тобою вчинив, отже праведний Ти в слові Твоїм і справедливий у присуді Твоїм.",
      "Ось бо в беззаконні зачатий я, і в гріхах породила мене мати моя.",
      "Бо Ти істину полюбив єси, невідоме й таємне мудрості Твоєї явив Ти мені.",
      "Окропи мене ісопом – і очищуся, омий мене – і стану біліший від снігу.",
      "Дай мені почути радість і веселість – і зрадіють кістки мої упокорені.",
      "Відверни лице Твоє від гріхів моїх і прости всі беззаконня мої.",
      "Серце чисте створи в мені, Боже, і духа праведного віднови в нутрі моєму.",
      "Не відкинь мене від лиця Твого і Духа Твого Святого не відніми від мене.",
      "Поверни мені радість спасіння Твого і духом могутнім укріпи мене.",
      "Навчатиму беззаконників шляхів Твоїх, і нечестиві навернуться до Тебе.",
      "Визволи мене від вини кривавої, Боже, Боже спасіння мого, і язик мій радісно славитиме Правду Твою.",
      "Господи, відкрий уста мої, і язик мій сповістить хвалу Твою.",
      "Бо коли б Ти жертви забажав, приніс би я: всепалення ти не бажаєш.",
      "Жертва Богові – це дух упокорений, серцем скорботним і смиренним Ти не погордуєш.",
      "Ущаслив, Господи, благоволінням Твоїм Сіон, і нехай збудуються стіни Єрусалимські.",
      "Тоді буде угодна Тобі жертва Правди, приношення і всепалення: тоді положать на Жертовник Твій тельців."
    ],
    "youtubeId": ""
  },
  {
    "id": "zariu-nebesnyi",
    "title": "Царю Небесний",
    "article": [
      "Царю Небесний, Утішителю, Душе істини, що всюдиєси і все наповняєш, скарбе добра і життя Подателю, прийди і вселися в нас, і очисти нас від усякої скверни, і спаси, Благий, душі наші."
    ],
    "youtubeId": ""
  }
]
